{
  "queue": [
    {
      "id": "https://www.reddit.com/r/unity/t3_1qd6u3v",
      "type": "post",
      "subreddit": "unity",
      "title": "Can someone help me help my son!",
      "content": "My son (11 years) recently downloaded Unity but cannot access the scripts. I know absolutely nothing about Unity and cannot help him. Can anyone help me out? TIA! submitted by /u/djheart [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qd6u3v/can_someone_help_me_help_my_son/",
      "author": "/u/djheart",
      "search_keyword": "",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.220453"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qd3aq9",
      "type": "post",
      "subreddit": "unity",
      "title": "Driving Roguelike Trailer",
      "content": "submitted by /u/danieltabori [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qd3aq9/driving_roguelike_trailer/",
      "author": "/u/danieltabori",
      "search_keyword": "",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.220466"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qd5i9b",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "Tensorboard logs not generating during training",
      "content": "'Use Tensorboard' is set to True and it has been installed correctly in the python directory, but the project isnt generating any tf files for tensorboard to be read. I have checked my 'Intermediate' and 'Saved' directories but there is no subdirectory 'Tensorboard\\runs'. Is there any other setting that I am missing? submitted by /u/donotthekitty1 [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qd5i9b/tensorboard_logs_not_generating_during_training/",
      "author": "/u/donotthekitty1",
      "search_keyword": "",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.220570"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qcxdlt",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "UE5 Mannequin Clothing/Armor/Equipment",
      "content": "To save myself from having to dig, does anyone know of a bundle either on FAB or elsewhere that already have clothing/armor/equipment that is already properly transformed to fit UE5 Mannequins (Manny and/or Quinn)? Alternatively, any tools or plugins that can easily transform clothing/armor/equipment to fit Manny and/or Quinn? submitted by /u/daoovud [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qcxdlt/ue5_mannequin_clothingarmorequipment/",
      "author": "/u/daoovud",
      "search_keyword": "",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.220600"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qda788",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "My 2 cents -> Watch people play your game! It's very useful! Do it!",
      "content": "You will learn so much, find many things to improve (things that needs more explaining, are too hard, etc.), fix new bugs and therefore will end-up greatly improving your game! On top of that, you will meet awesome people! Only wins! Edit: should have said: do it early! And with streamers is best! submitted by /u/Nimillion-game [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qda788/my_2_cents_watch_people_play_your_game_its_very/",
      "author": "/u/Nimillion-game",
      "search_keyword": "",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.220679"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qd9dz8",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "Trying to understand the real journey of earning money with an Android app",
      "content": "I did a little research, and at a high level it looks like this. You build the app, publish it on Google Play after the review, and if it’s a paid app, users pay. But I know this is a very simplified view. I want to understand how this actually looks in real life. How people go from an idea to something published. What really happens after publishing. How money starts coming in, or doesn’t. Where things get complicated, slow, or harder than expected. I’m also curious about how people actually find users. What you did to get the first users. Whether you spent a lot on ads, spent a little, or didn’t run ads at all. What worked, what didn’t, and what you would do differently now. If you’ve tried earning money with an Android app, I’d really like to hear how it went for you. The parts that were not obvious at the start. The things you wish you knew earlier. The reality behind “just build and publish”. I’m trying to learn from real journeys before deciding what to build. submitted by /u/Such_Ad_7545 [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qd9dz8/trying_to_understand_the_real_journey_of_earning/",
      "author": "/u/Such_Ad_7545",
      "search_keyword": "",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.220717"
    },
    {
      "id": "https://www.reddit.com/r/gamedesign/t3_1qcn2vr",
      "type": "post",
      "subreddit": "gamedesign",
      "title": "What are ways of painlessly removing content from games?",
      "content": "Long-running evolving games often end up with baggage of earlier design that just doesn't mesh with the game as it exists right now, and for the health of the game, it'd be better if they were gone. But players tend to react badly to having content removed, even if it's good for the game as a whole. What are ways to make it hurt less? Magic famously has (had? Standard is in shambles) set rotation that made people accept the fact stuff, both fun and miserable, is temporary and if something is annoying, busted or confusing — well, who cares, it won't be around in two years. What are other approaches? submitted by /u/Majestic_Hand1598 [link] [comments]",
      "link": "https://www.reddit.com/r/gamedesign/comments/1qcn2vr/what_are_ways_of_painlessly_removing_content_from/",
      "author": "/u/Majestic_Hand1598",
      "search_keyword": "",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.221030"
    },
    {
      "id": "https://www.reddit.com/r/gamedesign/t3_1qcicd8",
      "type": "post",
      "subreddit": "gamedesign",
      "title": "I have made my early game Unit too complex",
      "content": "So my Tower Defense game is planned to have 12 Characters total which I think is an Okay amount for medium sized project like this. But because I had made several tower defense project in the past I accidentally complexity creep on this project and ended up giving my tower, whole lot of mechanic like Unit from game that have long lifespan. My first tower ended up being Melee Tower which has Pierce Cap, Stun Block, Freezing Mechanic which they also take another sentence or 2 to explain. Such as Enemy have \"Freeze Resistance\" and \"Freeze Decay\" based on their HP, Freeze Resist is like enemy's HP but for ice, when you attack them with attack that inflict freeze, they slow down until Freeze go above their Freeze Resistance which they're frozen solid. Freeze Decay reduce freeze on enemy. which is LOT of things to explain to my friend and lot of things to comprehend at once I do not want to just simplify things because most of them are restriction and they kinda hold each towers up like glues and I do not want to just add more characters because I already struggle at giving them proper screentime and writing for them. My currently only released game which is a card game also have this issue as I based this game on other game and just- doubled the mechanic and double the text count which is not smth I can explain easily in my tutorial... Few solution I think I found are - Just don't tell, Let them notice for themselves, When they see freeze stack on enemy they're gonna go like: \"cool, they slow down enemy\" - Let upgrade system tell about the tower piece by piece? - Get out of my Comfort Zone and kill my darling by simplifying them so it's more comprehensible (First time posting here, kinda nervous) submitted by /u/cpiyaphum [link] [comments]",
      "link": "https://www.reddit.com/r/gamedesign/comments/1qcicd8/i_have_made_my_early_game_unit_too_complex/",
      "author": "/u/cpiyaphum",
      "search_keyword": "",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.221118"
    },
    {
      "id": "https://www.reddit.com/t5_325lr",
      "type": "search",
      "subreddit": "NoMansSkyTheGame",
      "title": "No Man's Sky | Reddit",
      "content": "The unofficial subreddit for the discussion of No Man's Sky. A fantasy science-fiction game set in an infinite, procedurally-generated universe. [link]",
      "link": "https://www.reddit.com/r/NoMansSkyTheGame/",
      "author": "unknown",
      "search_keyword": "no code game",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.221239"
    },
    {
      "id": "https://www.reddit.com/t5_3gbip",
      "type": "search",
      "subreddit": "nocode",
      "title": "The Official No-Code Community of Reddit",
      "content": "No-Code Community dedicated to building cool things without needing to be a developer. [link]",
      "link": "https://www.reddit.com/r/nocode/",
      "author": "/u/whitisj",
      "search_keyword": "no code game",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.221245"
    },
    {
      "id": "https://www.reddit.com/t3_1qdexps",
      "type": "search",
      "subreddit": "TopCharacterTropes",
      "title": "(Interesting trope) Media that seems like regular creepy gameplay at first, but once you look deeper, there’s a story behind it that requires lots of thinking",
      "content": "Similar to an ARG, these are mainly hidden in ROMs 1: The Forest King (‘The Coronation Day): A decade ago (I think), a random user in Mario forum suddenly posted a game titled “‘the”. Throughout the gameplay, it seems to be a copy of a 2D Mario game. Once the game is “beaten”, there’s hidden lore that Mario and Peach were married, and Mario wanted to make a house for them. Suddenly, Peach gets kidnapped (I think), and she gets sacrificed to an entity that lives within a forest, using her body as a skin suit while also being openly sadistic about it. There’s recently been a sequel to this a few months ago, but I’m still trying to figure out the continued lore. 2: END (Green Mountain): Same thing as the creator of “‘the”, you play as Sonic through an overly saturated Green Hill that has no enemies but you climb up a mountain. At the top, you fight against what appears to be yourself who is actively running away from you and trying to escape. Once you eventually kill it, you slowly start to become it . But during the game, or after the game, there seems to be a conversation hidden within the game’s code. From what I’ve gathered from it, there’s a story about two people who travel up a mountain (I think to bury someone), but once they reach the top of the mountain, they discover a corpse of something that might resemble END. submitted by /u/Isaacja223 to r/TopCharacterTropes [link] [comments]",
      "link": "https://www.reddit.com/r/TopCharacterTropes/comments/1qdexps/interesting_trope_media_that_seems_like_regular/",
      "author": "/u/Isaacja223",
      "search_keyword": "no code game",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.221395"
    },
    {
      "id": "https://www.reddit.com/t3_1qdeskk",
      "type": "search",
      "subreddit": "Brawlstars",
      "title": "Support is preventing me from recovering my account from thief.",
      "content": "My account has been stolen and even tho im able to change account email to mein using Supercell ID Recovery Codes, the game doesn't let me change the account protection phone number to completely kick out the hacker. Because of this the intruder can just change the email back to his own. I have only 1 recovery code left. What can i do? Spend 2 days trying to talk to a real human in support, but no success. submitted by /u/Autistic-Talk to r/Brawlstars [link] [comments]",
      "link": "https://www.reddit.com/r/Brawlstars/comments/1qdeskk/support_is_preventing_me_from_recovering_my/",
      "author": "/u/Autistic-Talk",
      "search_keyword": "no code game",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.221409"
    },
    {
      "id": "https://www.reddit.com/t3_1qderho",
      "type": "search",
      "subreddit": "indiegames",
      "title": "I used my hyperfocus to create a browser game",
      "content": "Hi everyone, whats up? :) I’m autistic and have a strong hyperfocus on geography and maps, so I decided to turn that into a game. Urbexle is a Worldle style browser game where you try to guess the city by seeing only its street layout. No names or landmarks, just the streets. The game includes cities from all over the world and has full coverage of Brazil with all 5,570 municipalities. I’m not a developer. I've never programmed before and I'm learning, and I had help from AI to write the code, but the idea was entirely mine and I put it into practice. There might be bugs and errors. The site is available in three languages. Feedback is very welcome. https://urbexle.vercel.app/ submitted by /u/membroesquizofrenico to r/indiegames [link] [comments]",
      "link": "https://www.reddit.com/r/indiegames/comments/1qderho/i_used_my_hyperfocus_to_create_a_browser_game/",
      "author": "/u/membroesquizofrenico",
      "search_keyword": "no code game",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.221434"
    },
    {
      "id": "https://www.reddit.com/t3_1qdf0zk",
      "type": "search",
      "subreddit": "gameDevPromotion",
      "title": "Bad Doctor for Android. Sharing my new Game’s Gameplay",
      "content": "Hi Community, I’m working on an endless runner game named “Bad Doctor” from last 7 months. I’m sharing a short gameplay video to get feedback from you as a player. I appreciate honest feedback directly from community of true game lovers. it’s a android game made using Unity Engine. All the 3D assets & textures are handmade by me in blender. Characters are made using blender plugin “MakeHuman”. Game Theme: player is running away from bad doctor & keep avoiding obstacles in way while running. Game Type: Endless runner (similar to temple run & subway surfer) Wanna Play ?? https://play.google.com/store/apps/details?id=drx.bad.doctor 🔗Website: https://deveshrx.com/games/bad-doctor submitted by /u/deveshrx to r/gameDevPromotion [link] [comments]",
      "link": "https://www.reddit.com/r/gameDevPromotion/comments/1qdf0zk/bad_doctor_for_android_sharing_my_new_games/",
      "author": "/u/deveshrx",
      "search_keyword": "make game without coding",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.221493"
    },
    {
      "id": "https://www.reddit.com/t3_1qdf0yu",
      "type": "search",
      "subreddit": "PCOS",
      "title": "What to put in morning coffee to not spike blood sugar?",
      "content": "Dear Pcos community, having my coffee with oat milk in the morning makes me happy but I am looking for alternatives to oat milk to have some cappuccino feeling. Diary does not work as it makes my symptoms worse. Any tips on alternatives? I know I should drink it without anything but maybe you have a good alternative? Thanks!!! submitted by /u/Plus-Improvement-355 to r/PCOS [link] [comments]",
      "link": "https://www.reddit.com/r/PCOS/comments/1qdf0yu/what_to_put_in_morning_coffee_to_not_spike_blood/",
      "author": "/u/Plus-Improvement-355",
      "search_keyword": "make game without coding",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.221505"
    },
    {
      "id": "https://www.reddit.com/t3_1qdes1u",
      "type": "search",
      "subreddit": "attacksharkgaming",
      "title": "One headset to rule them all? 🧙♂️💥",
      "content": "The ATTACK SHARK L30 PRO. • 4 ways to connect (2.4G/Bluetooth/AUX/AUX-to-C) • 20ms low latency for comp play • 7.1 surround sound & AI noise-canceling mic • Aluminum frame + all-day comfort • Software customization Game on ANY device. Hear EVERYTHING. submitted by /u/attacksharkgaming to r/attacksharkgaming [link] [comments]",
      "link": "https://www.reddit.com/r/attacksharkgaming/comments/1qdes1u/one_headset_to_rule_them_all/",
      "author": "/u/attacksharkgaming",
      "search_keyword": "AI game maker",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.221920"
    },
    {
      "id": "https://www.reddit.com/t3_1qder6o",
      "type": "search",
      "subreddit": "visualnovels",
      "title": "I still don't have any VN on Steam. Is the Humble Bundle VN bundle a good place to start?",
      "content": "After discussing it with a few clankers and checking myself online, it seems the games (mostly Needy Streamer Overlord, which I won't play, but also Gal Gun and IMHhW) are very regarded by the community. so, I'm here to ask the community - for $12, what do I get? [To clarify - it's not that I'm completely new, I watched a lot of Anime and played a few VN's in... bad ways. I don't do those anymore.] (By the way - my text editor thingy told me I have some mistakes, but I won't fix them, since it will look AI if it's too proffessional, lol) https://preview.redd.it/2revdkilahdg1.png?width=725&format=png&auto=webp&s=5e41e4cad877e3b10e45de8891461069d6b5fcba https://preview.redd.it/271f2oplahdg1.png?width=724&format=png&auto=webp&s=f07121a486e41fbd7ac4c55a21b73b6a0f259630 submitted by /u/Upstairs-Speaker6525 to r/visualnovels [link] [comments]",
      "link": "https://www.reddit.com/r/visualnovels/comments/1qder6o/i_still_dont_have_any_vn_on_steam_is_the_humble/",
      "author": "/u/Upstairs-Speaker6525",
      "search_keyword": "AI game maker",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.221938"
    },
    {
      "id": "https://www.reddit.com/t5_2sg66",
      "type": "search",
      "subreddit": "gameDevClassifieds",
      "title": "The game industry job board on Reddit",
      "content": "Share your game industry-related services or available positions. Ensure your posts are safe for work (SFW) to provide a worry-free browsing experience for recruiters and professionals. [link]",
      "link": "https://www.reddit.com/r/gameDevClassifieds/",
      "author": "/u/mondomaniatrics",
      "search_keyword": "game dev beginner",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.221945"
    },
    {
      "id": "https://www.reddit.com/t3_1qdew7m",
      "type": "search",
      "subreddit": "FUTMobile",
      "title": "Can yall lock tf in?",
      "content": "STOP BEING SWAYED BY THE SHIT THAT EA GIVES YOU! Good lord, I have saw so many people ranting the first day, but as soon as EA gave yall some puny tokens, yall seemed to forgot. Yall also seemed to forgot that EA WILL SQUEEZE THE LAST FEW DROPS OF MONEY FROM YOU! They are a greddy ass company with no morals, nothing. And all you became quiet when you get a single 117 player and Messi/Ronaldo in your pack? Screw off. All of you are sheeps if you keep supporting on this shit that EA does. It's stupid. I'm sorry to say this but all of you are idiots if you get this quickly manipulated by that. You don't want the game back, you are just happy by the shitty treatment that EA gives you. Don't want to be stupid? BOYCOTT EA FOR REALS! I know this shit won't be seen by the devs, hell, I doubt that it will be seen by the people. But I'll tell you this, this game is one step away from being ruined. submitted by /u/DigitalMicha to r/FUTMobile [link] [comments]",
      "link": "https://www.reddit.com/r/FUTMobile/comments/1qdew7m/can_yall_lock_tf_in/",
      "author": "/u/DigitalMicha",
      "search_keyword": "game dev beginner",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.221997"
    },
    {
      "id": "https://www.reddit.com/t3_1qdet5k",
      "type": "search",
      "subreddit": "ArmaReforger",
      "title": "HQC dead?",
      "content": "I can't enjoy conflict mode because it is way too repetitive and spammy and resources, tactics or teamplay are not optimal in that game mode from what I've seen and there is only one or two populated HQC modes on vanilla. Is it is really that vast majority prefers conflict or is it because servers aren't there? There is a definate contrast between Conflict and HQC teamplay wise and it is more rewarding less clusterfuck for me. I don't want a military simulation I just can't enjoy how spammy the conflict is. Buy a car> drive > die. And repeat. Generally most important factor is how fast you can respawn when capturing points it is just a glorified Team Deathmatch. Why do you dislike HQC? I am actually wondering and if the devs will just let the HQC die. submitted by /u/zaho2059 to r/ArmaReforger [link] [comments]",
      "link": "https://www.reddit.com/r/ArmaReforger/comments/1qdet5k/hqc_dead/",
      "author": "/u/zaho2059",
      "search_keyword": "game dev beginner",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.222213"
    },
    {
      "id": "https://www.reddit.com/t3_1qderfk",
      "type": "search",
      "subreddit": "UnrealEngine5",
      "title": "WIP Statue of Lady of the Lake Environment",
      "content": "Dev Update – Lady of the Lake Statue Made some progress on a new environment prop: a stylized statue of the Lady of the Lake. Sculpted entirely in Blender. Focused on giving her a calm but powerful stance, with Excalibur held upright as if frozen mid-ritual. Most of the work went into the flowing robes and hair to create a mythic and elegant silhouette. For the materials, I aimed for an ancient, water-worn look—cool stone tones, hints of green, and subtle magical highlights to tie her back to the lake. This statue will show up in several key areas of the game as a recurring symbol of the Lady’s presence. More environment pieces coming soon, and also don't forget to join the official Discord https://discord.com/invite/jcEmRuk5wS submitted by /u/RomarioDev to r/UnrealEngine5 [link] [comments]",
      "link": "https://www.reddit.com/r/UnrealEngine5/comments/1qderfk/wip_statue_of_lady_of_the_lake_environment/",
      "author": "/u/RomarioDev",
      "search_keyword": "game dev beginner",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.222238"
    },
    {
      "id": "https://www.reddit.com/t3_1qdf0kt",
      "type": "search",
      "subreddit": "aiagents",
      "title": "Help pls!! How do y'll handle tire-kickers and lowball inquiries online and not wasting hours? Can someone drop tips for filtering serious buyers before contact?",
      "content": "Lately, I’ve noticed a huge spike in online leads that go nowhere, all sorts of people asking if a car is available, showing no intention to buy, or sending lowball offers. these things waste my team's hours and makes it hard to focus on serious buyers. I’m curious how other dealers handle this and what strategies actually help filter out time-wasters before they reach you. or should I not fret over this? Think of it as part and parcel of the game submitted by /u/AutoMarket_Mavericks to r/aiagents [link] [comments]",
      "link": "https://www.reddit.com/r/aiagents/comments/1qdf0kt/help_pls_how_do_yll_handle_tirekickers_and/",
      "author": "/u/AutoMarket_Mavericks",
      "search_keyword": "how to make a game",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:30:53.222311"
    },
    {
      "id": "https://www.reddit.com/r/gamedev/t3_1qdebv1",
      "type": "post",
      "subreddit": "gamedev",
      "title": "How do you texture medium sized assets?",
      "content": "I am currently modeling a stone column for an old temple. I plan to split it into 3 sections (a base, mid and top), with the long mid section using a tileable stone material. My problem originates from the base however: I wanted to model out a high poly for it with edgewear, chipped corners and all that fancy stuff (which I already did actually). However even the base piece by itself is too big to have its UVs fit within a 1024 texture box (that's what I've been using for the rest of the environment). What is usually the best approach for medium sized assets like that? Should I give up on the fancy normal map and just use a seamless texture there as well? Or should I perhaps break the consistency of my environment's texel density by downsizing the asset's UVs to fit? I am aware about trim sheets as well, but I don't know if trying to simulate specific edgewear with those is the standard go to. submitted by /u/InkStep [link] [comments]",
      "link": "https://www.reddit.com/r/gamedev/comments/1qdebv1/how_do_you_texture_medium_sized_assets/",
      "author": "/u/InkStep",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.219820"
    },
    {
      "id": "https://www.reddit.com/r/gamedev/t3_1qddsmx",
      "type": "post",
      "subreddit": "gamedev",
      "title": "Pacman smooth turning",
      "content": "So I am trying to make a pacman on SFML C++ Visual Studio. I have already done the collision. My problem now is getting the player to make a smooth turn. I don't want him to be wiggling to the side when there's no open corridor to the direction he wants to turn into. How did the developers of the game even do that smooth turning? When I play the original pacman game, they always seem to be able to turn corners without bumping into the walls. submitted by /u/Popular_Camel8575 [link] [comments]",
      "link": "https://www.reddit.com/r/gamedev/comments/1qddsmx/pacman_smooth_turning/",
      "author": "/u/Popular_Camel8575",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.219836"
    },
    {
      "id": "https://www.reddit.com/r/gamedev/t3_1qd84tj",
      "type": "post",
      "subreddit": "gamedev",
      "title": "Do you know any good pixel art app for tablets (preferably with free download) good for RPG maker or GB studio?",
      "content": "I recently started my game And one of the things I found most difficult was the game's art, since the app i originaly used was giving me problems and i dont know any other. Do someone has any sugestions? submitted by /u/Acceptable_Item_8989 [link] [comments]",
      "link": "https://www.reddit.com/r/gamedev/comments/1qd84tj/do_you_know_any_good_pixel_art_app_for_tablets/",
      "author": "/u/Acceptable_Item_8989",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.219985"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qderrk",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "WIP Statue of Lady of the Lake Environment",
      "content": "submitted by /u/RomarioDev [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qderrk/wip_statue_of_lady_of_the_lake_environment/",
      "author": "/u/RomarioDev",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220072"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdd6vx",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Cult of Five Demo is now live!",
      "content": "submitted by /u/Fit-Rub5611 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdd6vx/cult_of_five_demo_is_now_live/",
      "author": "/u/Fit-Rub5611",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220135"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdd5un",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Cult of Five demo is now live!",
      "content": "https://store.steampowered.com/app/4246750/Cult_of_Five submitted by /u/Fit-Rub5611 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdd5un/cult_of_five_demo_is_now_live/",
      "author": "/u/Fit-Rub5611",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220140"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdcsq2",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Assembled the ship from the TV series Firefly in the ship editor of my game",
      "content": "submitted by /u/CubicPie [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdcsq2/assembled_the_ship_from_the_tv_series_firefly_in/",
      "author": "/u/CubicPie",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220146"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdc80b",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Here's how we design levels for our puzzle game",
      "content": "submitted by /u/TandDA [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdc80b/heres_how_we_design_levels_for_our_puzzle_game/",
      "author": "/u/TandDA",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220151"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdbqjq",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Finally added customisation in my game, CHROMADI",
      "content": "submitted by /u/Kleanup-Games [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdbqjq/finally_added_customisation_in_my_game_chromadi/",
      "author": "/u/Kleanup-Games",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220157"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdf4cw",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "What do you think of this workflow? What workflow do you use in your gamedev?",
      "content": "submitted by /u/ObjectiveWilling3958 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdf4cw/what_do_you_think_of_this_workflow_what_workflow/",
      "author": "/u/ObjectiveWilling3958",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220163"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdf31s",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "Good Games 345 - Hungry Horrors",
      "content": "An exceedingly well-polished card battler where a princess feeds mythical monsters. https://youtu.be/lv8RfyAurjE submitted by /u/FortKenmei [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdf31s/good_games_345_hungry_horrors/",
      "author": "/u/FortKenmei",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220169"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdedzk",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "What do you think of our new door feature?",
      "content": "submitted by /u/EffortStar [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdedzk/what_do_you_think_of_our_new_door_feature/",
      "author": "/u/EffortStar",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220196"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qde03j",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "Creating healthy blueprint dependencies (UE)",
      "content": "submitted by /u/jnexhip [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qde03j/creating_healthy_blueprint_dependencies_ue/",
      "author": "/u/jnexhip",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220201"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdds6u",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "Checking how many clients will my shop simulator handle",
      "content": "Wishlist MEDIEVAL SHOP SIMULATOR submitted by /u/BeastGamesDev [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdds6u/checking_how_many_clients_will_my_shop_simulator/",
      "author": "/u/BeastGamesDev",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220207"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qddjn6",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "I’m working on a new biome and made this space — how does it feel?",
      "content": "I’ve been working on a new biome and wanted to share this moment. You move through a tight space and suddenly step into a huge open area — and there it is, a massive crystal sitting right in the middle. The whole area just feels good to walk through. Still a work in progress, but this part turned out way cooler than I expected. I’m really excited to see how this biome turns out. submitted by /u/BusyNectarine6795 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qddjn6/im_working_on_a_new_biome_and_made_this_space_how/",
      "author": "/u/BusyNectarine6795",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220265"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdd89d",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "Exploration vs planning: designing the event map for our roguelike deck-builder",
      "content": "Hey folks 👋 We’re continuing work on our roguelike deck-builder, and I wanted to share where our thinking is right now. We’re exploring two directions: • Exploration-first maps that stay hidden and reveal themselves step by step • Tactical branching, where the full route is visible and players plan ahead around fights, shops, and risks For now, we’re leaning toward exploration-focused runs. The video shows a rough full layout, but in actual gameplay the map would be revealed gradually as you progress. Curious to hear your take: in roguelike deck-builders, do you personally prefer discovering the path as you go, or planning the whole run from the start? submitted by /u/SidrickWhite [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdd89d/exploration_vs_planning_designing_the_event_map/",
      "author": "/u/SidrickWhite",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220289"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdehfk",
      "type": "post",
      "subreddit": "godot",
      "title": "TileMapLayer physics",
      "content": "Does anyone know how TileMapLayers interact with physics spaces in the PhysicsServer? I want to make 2 Physics spaces that have 2 different tile maps between them (regular world vs phantom world 👻 spooky spooky) so that CharacterBodies can operate between worlds submitted by /u/magicman_coding [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdehfk/tilemaplayer_physics/",
      "author": "/u/magicman_coding",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220302"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdebzx",
      "type": "post",
      "subreddit": "godot",
      "title": "Building a Black Hole Shader in Godot 4",
      "content": "submitted by /u/TkTech [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdebzx/building_a_black_hole_shader_in_godot_4/",
      "author": "/u/TkTech",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220307"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qde9aw",
      "type": "post",
      "subreddit": "godot",
      "title": "I've created a bit of a monster",
      "content": "submitted by /u/Code_Monster [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qde9aw/ive_created_a_bit_of_a_monster/",
      "author": "/u/Code_Monster",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220312"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qddj2a",
      "type": "post",
      "subreddit": "godot",
      "title": "Not fullscreen on web export",
      "content": "Help I'm trying to export my game as a web but idk why it always going full screen, like I just want to make the game go the actual viewport, and doesn't take the entire screen because this game was uploaded as an mini game and when this game got played it overlap the background. I tried setting every canvas to not extend buttheh game always take the entirescreena especially the splash screen. Thank you submitted by /u/Valonekiil [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qddj2a/not_fullscreen_on_web_export/",
      "author": "/u/Valonekiil",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220336"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdcgmh",
      "type": "post",
      "subreddit": "godot",
      "title": "Parallax shader artifacts",
      "content": "I'm having an issue with this cloud shader, It works flawlessly in the editor but when I run the scene it will occasionally flash these artifacts. It will last between a few frames to a couple of seconds before returning to how it's supposed to look. I've updated my drivers and my graphics card is only a few months old with no other issues. So maybe something is wrong with my shader code? (aside from bad writing practices) submitted by /u/B_Dappy [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdcgmh/parallax_shader_artifacts/",
      "author": "/u/B_Dappy",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220361"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdbkx6",
      "type": "post",
      "subreddit": "godot",
      "title": "Why are most Games still being made using Unity or Unreal instead of Godot?",
      "content": "Considering Unity being a Propieatary Shit Hole nowadays and Unreal being too Heavy for most Machines (atleast my entire Unreal College Class was like that even tho we got Gaming Laptops from them sent out) I wonder as to why Godot isnt as Popular? Like it has all the Pros of Indie Game Development A Good Eco System, Plugin/Mod Support, Open Source I do not understand as to why more People arent using it honestly submitted by /u/FatnUgly88 [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdbkx6/why_are_most_games_still_being_made_using_unity/",
      "author": "/u/FatnUgly88",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220398"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdb3e8",
      "type": "post",
      "subreddit": "godot",
      "title": "Godot bros (and ladies) should I \"release a demo\"",
      "content": "i dont wanna say release a demo like I'm big time. All i want to know is if the world is going to hate me if theres bugs. thank you. submitted by /u/ElectronicsLab [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdb3e8/godot_bros_and_ladies_should_i_release_a_demo/",
      "author": "/u/ElectronicsLab",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220405"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qddwu0",
      "type": "post",
      "subreddit": "unity",
      "title": "A new video about less known Unity Editor features",
      "content": "Made another video in the series, this time focusing on editor tricks. The first two parts covered API features, but this one is all about working in the editor. Some of these have been around forever, others are newer. Piercing Selection Menu - select any element under the cursor, even through overlapping objects (Unity 6+) Overlay System - toggle and organize overlay menus in the scene view Object Isolation - hide everything except the selected object Advanced Search - powerful search with expressions that can find missing references, filter by texture size, and more WASD Navigation - fly through the scene like in a video game Watch Here: https://www.youtube.com/watch?v=2TN8LCoUApU&list=PLgFFU4Ux4HZrSCmDQi0yTMuK9M79D7mFb&index=3 submitted by /u/migus88 [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qddwu0/a_new_video_about_less_known_unity_editor_features/",
      "author": "/u/migus88",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220424"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qddrg0",
      "type": "post",
      "subreddit": "unity",
      "title": "Checking how many clients will my shop simulator handle",
      "content": "submitted by /u/BeastGamesDev [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qddrg0/checking_how_many_clients_will_my_shop_simulator/",
      "author": "/u/BeastGamesDev",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220429"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qdbehf",
      "type": "post",
      "subreddit": "unity",
      "title": "What do you think of my new explosion in my burrito game? It is supposed to be hot sauce exploding and dripping down and destroying the burrito meat. Any feedback is greatly appreciated!",
      "content": "submitted by /u/SPACEGAMESstudio [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qdbehf/what_do_you_think_of_my_new_explosion_in_my/",
      "author": "/u/SPACEGAMESstudio",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220437"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qd7k1z",
      "type": "post",
      "subreddit": "unity",
      "title": "In the last few days I've been working on a procedural building system inspired by Tiny Glade, but I'm doing it in Unity 6 with some GPU processing and rendering features and DOT-based elements. Suggestions are welcome for me to try to improve or add to it.",
      "content": "submitted by /u/wellzigomes [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qd7k1z/in_the_last_few_days_ive_been_working_on_a/",
      "author": "/u/wellzigomes",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220446"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qd1usb",
      "type": "post",
      "subreddit": "unity",
      "title": "Finally achieved my very long standing technical goal! (Multipurpose 2D graphics)",
      "content": "I've always been surprised that Unity lacks a proper, multipurpose, high-performance 2D drawing engine. For years, this has been my classic \"come back to it when bored\" fun project, and lately it became my benchmarking task for testing how capable new LLM models really are. I've explored multiple approaches over the years. Now, spending a bit more time on it over the holidays, I finally cooked it. Here is not very well optimized yet, but a complex SVG-style, path command based Bad Apple playing smoothly on a regular 1024² Texture2D at roughly 0.05 ms per frame submitted by /u/No_Diver_3961 [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qd1usb/finally_achieved_my_very_long_standing_technical/",
      "author": "/u/No_Diver_3961",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220486"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qd0qoa",
      "type": "post",
      "subreddit": "unity",
      "title": "Developing our 2D survival game in Unity",
      "content": "A visual video of how our LOD system works. Everything marked with red lines isn't displayed. Also, the rectangles indicate how objects are updated submitted by /u/Shadow_Moder [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qd0qoa/developing_our_2d_survival_game_in_unity/",
      "author": "/u/Shadow_Moder",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220493"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qcz8ga",
      "type": "post",
      "subreddit": "unity",
      "title": "Trying out Ricocheting Projectiles",
      "content": "Working on different items/abilities you can unlock and take on your next run in my game Project BLACKNODE submitted by /u/melvinweert [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qcz8ga/trying_out_ricocheting_projectiles/",
      "author": "/u/melvinweert",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220500"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qddzrc",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "Creating healthy dependencies",
      "content": "submitted by /u/jnexhip [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qddzrc/creating_healthy_dependencies/",
      "author": "/u/jnexhip",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220505"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qddpox",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "How do I implement a working firearm pickup system? - Blueprint",
      "content": "Hi. I'm actually the one who posted that discussion accessible through the link provided in this post. Your comments posted either here or in that discussion is appreciated. submitted by /u/Snowbrae_Thomasso [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qddpox/how_do_i_implement_a_working_firearm_pickup/",
      "author": "/u/Snowbrae_Thomasso",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220513"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qdd96z",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "I built a custom RDG compute pass in Unreal Engine and finally understood why RDG is so strict",
      "content": "I’ve been trying to properly understand Unreal Engine’s Render Dependency Graph (RDG) for a while, and it never really clicked until I tried to build a custom compute pass and broke it in multiple ways . This write-up walks through: How Unreal’s shader parameter system actually feeds into RDG Why RDG cares so much about explicit read/write intent A SceneColor bug that produced black frames with zero warnings How creating a temporary RDG texture fixed everything The goal wasn’t a perfect implementation, but to build intuition around how data flows through the renderer and why RDG refuses to guess. Would love to hear how others approached learning RDG, or if you’ve hit similar “everything compiled but nothing worked” moments. submitted by /u/agentnuclear [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qdd96z/i_built_a_custom_rdg_compute_pass_in_unreal/",
      "author": "/u/agentnuclear",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220539"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qd9yke",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "Hello guys anyone interested in testing my game ? Testing period is max 3 days since I’m launching in 2 weeks 😀",
      "content": "Anyone interested in testing my game? submitted by /u/Specialist-World6841 [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qd9yke/hello_guys_anyone_interested_in_testing_my_game/",
      "author": "/u/Specialist-World6841",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220549"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qd87d3",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "Battle Royale",
      "content": "I had an idea for a battle royale that I want to make reality. I tried dipping my toes into coding a while back but lost motivation, so I never got far. I wanna get back in and make my battle royale, anything I can expect from the process? And ideas as to how difficult it may be compared to trying other game types? submitted by /u/Know_Pros [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qd87d3/battle_royale/",
      "author": "/u/Know_Pros",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220559"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qd468g",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "Why don't UE have a code alternative to visual programming?",
      "content": "It would be great if you could put lua/python in blueprints instead of dragging code blocks. Edit: I was doing mods that didn't allow c++ for security reasons so stuck with visual blocks. submitted by /u/arstarsta [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qd468g/why_dont_ue_have_a_code_alternative_to_visual/",
      "author": "/u/arstarsta",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220579"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qd2c7y",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "DLSS for rendering",
      "content": "Has anyone used DLSS 4 (or 4.5) for rendering in Unreal? Is it a noticeable improvement? I have a 5090 and heard DLSS might offer a significant improvement in Unreal rendering but I can't find much info from people who use it. I don't really play games on my computer so I never really looked at DLSS before but I keep hearing about its benefits. Especially now that DLSS 4.5 is out submitted by /u/thelesserkilo [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qd2c7y/dlss_for_rendering/",
      "author": "/u/thelesserkilo",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220590"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qcx5qp",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "Manually Editing Polygon Shapes in UV Editor",
      "content": "I have a tile floor material that I'm applying to a cylinder. Around the outer edge of the circular face, I want to have a single ring of tiles. Since these polygons are trapezoids, they will not properly fit a square tile and look a little funky. Is there a way to manipulate the polys in the UV editor to force the trapezoids to be a squares? submitted by /u/5paceCat [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qcx5qp/manually_editing_polygon_shapes_in_uv_editor/",
      "author": "/u/5paceCat",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220611"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdf2ep",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "What do you think about my graphics? (Mobile roguelike)",
      "content": "submitted by /u/Ok_hate_Game_Dev [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdf2ep/what_do_you_think_about_my_graphics_mobile/",
      "author": "/u/Ok_hate_Game_Dev",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220617"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdeyk4",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "What should I add next to my game ?",
      "content": "🎮 WHAT SHOULD WE ADD TO HIYAH GO? Hey everyone! Hiyah GO! is a mix between Pokémon, Mage Arena, and Fortnite. You pick your monster, jump into a battle royale, and shout your spells using your voice. Your monster can evolve twice and unlock new attacks, and you can find secret spell cards around the map for big heals or huge damage. What could I add to make the game better ? Feel free to suggest anything new features, new monsters, new modes, new spells, whatever you think would make it more fun! https://reddit.com/link/1qdeyk4/video/ra07envgdhdg1/player submitted by /u/Ok_Sport8740 [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdeyk4/what_should_i_add_next_to_my_game/",
      "author": "/u/Ok_Sport8740",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220637"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdejj1",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "Working on another special event for my racer",
      "content": "submitted by /u/mfgjames [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdejj1/working_on_another_special_event_for_my_racer/",
      "author": "/u/mfgjames",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220643"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdcsx3",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "Assembled the ship from the TV series Firefly in the ship editor of my game",
      "content": "submitted by /u/CubicPie [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdcsx3/assembled_the_ship_from_the_tv_series_firefly_in/",
      "author": "/u/CubicPie",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220649"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdbiy6",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "Forgot my own code additions :))",
      "content": "https://reddit.com/link/1qdbiy6/video/auchs2iscgdg1/player So, this is hilarious. I created the Laser Weapon months ago. As I'm going through code, I realized I had a (Max Level Dual Beams function) that I never properly called. It still needs some tweaking, but after fixing my max level checks/flags, the dual beams appeared. Early morning coding is great until you forget your own additions along the way. submitted by /u/Otherwise_Tension519 [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdbiy6/forgot_my_own_code_additions/",
      "author": "/u/Otherwise_Tension519",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220661"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdbeiq",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "What do you think of my new explosion in my burrito game? It is supposed to be hot sauce exploding and dripping down and destroying the burrito meat. Any feedback is greatly appreciated!",
      "content": "submitted by /u/SPACEGAMESstudio [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdbeiq/what_do_you_think_of_my_new_explosion_in_my/",
      "author": "/u/SPACEGAMESstudio",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220669"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qd9iax",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "My Steam Page is finally live!",
      "content": "HIIT is my first project, in development for almost 2 years! This is my shot on building a mix of 3D metroidvania/platformer/puzzle game. Suggestions and wishlists are all appreciated! submitted by /u/FiscoGames [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qd9iax/my_steam_page_is_finally_live/",
      "author": "/u/FiscoGames",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220688"
    },
    {
      "id": "https://www.reddit.com/r/gamedesign/t3_1qd66yv",
      "type": "post",
      "subreddit": "gamedesign",
      "title": "Collectors board game - does it exist?",
      "content": "So I just had an idea for a board game where it’ll be 4-6 players and based around some souvenirs or similar things people collect, such as spoons, stamps, coins, etc. Each player gets a different item, and collects like 25 on their player board, going around the game board with different cards that give boosts, debuffs, and other things. Best comparison for the game board I can think of is Mario party. Just wondering if there’s a collection-based game like this out there(the specific items, not the concept), or if it’s something somewhat original? submitted by /u/Firefox_1607 [link] [comments]",
      "link": "https://www.reddit.com/r/gamedesign/comments/1qd66yv/collectors_board_game_does_it_exist/",
      "author": "/u/Firefox_1607",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220815"
    },
    {
      "id": "https://www.reddit.com/t5_31ajv",
      "type": "search",
      "subreddit": "NoGameNoLife",
      "title": "No Game No Life",
      "content": "A subreddit for the popular series No Game No Life! [link]",
      "link": "https://www.reddit.com/r/NoGameNoLife/",
      "author": "/u/Burtry",
      "search_keyword": "no code game",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221232"
    },
    {
      "id": "https://www.reddit.com/t5_2rb2y",
      "type": "search",
      "subreddit": "coding",
      "title": "coding",
      "content": "Fuck /u/spez. [link]",
      "link": "https://www.reddit.com/r/coding/",
      "author": "/u/tty2",
      "search_keyword": "make game without coding",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221458"
    },
    {
      "id": "https://www.reddit.com/t5_2r0e3",
      "type": "search",
      "subreddit": "IndieGaming",
      "title": "IndieGaming",
      "content": "A place for indie games [link]",
      "link": "https://www.reddit.com/r/IndieGaming/",
      "author": "/u/MSTRGEO",
      "search_keyword": "make game without coding",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221463"
    },
    {
      "id": "https://www.reddit.com/t5_2qtly",
      "type": "search",
      "subreddit": "GameDevelopment",
      "title": "Game Development",
      "content": "/r/gamedevelopment is a community for serious discussion about anything related to game development. [link]",
      "link": "https://www.reddit.com/r/GameDevelopment/",
      "author": "/u/IhateEverything",
      "search_keyword": "make game without coding",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221469"
    },
    {
      "id": "https://www.reddit.com/t5_l3hwv",
      "type": "search",
      "subreddit": "PixelGameMaker",
      "title": "Pixel Game Maker",
      "content": "This is a subreddit dedicated to the latest release in the Maker series: Pixel Game Maker [link]",
      "link": "https://www.reddit.com/r/PixelGameMaker/",
      "author": "/u/PixelDJ",
      "search_keyword": "AI game maker",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221803"
    },
    {
      "id": "https://www.reddit.com/t5_2qw2g",
      "type": "search",
      "subreddit": "gamemaker",
      "title": "/r/gamemaker",
      "content": "This subreddit is dedicated to providing programmer support for the game development platform, GameMaker Studio. GameMaker Studio is designed to make developing games fun and easy. Coders can take advantage of its built in scripting language, \"GML\" to design and create fully-featured, professional grade games. This subreddit is not designed for promoting your content and is instead focused on helping people make games, not promote them. [link]",
      "link": "https://www.reddit.com/r/gamemaker/",
      "author": "/u/Clay_Pigeon",
      "search_keyword": "AI game maker",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221815"
    },
    {
      "id": "https://www.reddit.com/t5_2vru8",
      "type": "search",
      "subreddit": "GameDevTycoon",
      "title": "Game Dev Tycoon",
      "content": "This is the subreddit for the game: Game Dev Tycoon by Greenheart Games. Here you can discuss different strategies, achievements you've met, or anything about the game! [link]",
      "link": "https://www.reddit.com/r/GameDevTycoon/",
      "author": "/u/chad1312",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221953"
    },
    {
      "id": "https://www.reddit.com/t5_2qi0a",
      "type": "search",
      "subreddit": "gamedev",
      "title": "Game Development Discussions on Reddit",
      "content": "The subreddit covers various game development aspects, including programming, design, writing, art, game jams, postmortems, and marketing. It serves as a hub for game creators to discuss and share their insights, experiences, and expertise in the industry. [link]",
      "link": "https://www.reddit.com/r/gamedev/",
      "author": "unknown",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221976"
    },
    {
      "id": "https://www.reddit.com/t3_1qdetll",
      "type": "search",
      "subreddit": "Igamingworld",
      "title": "Will VR actually change sweepstakes gaming, or is it just hype?",
      "content": "The Gist: Basically, the industry is eyeing VR to solve the \"engagement\" problem. Traditional sweepstakes can feel a bit flat since you're just clicking a screen, so they’re looking at VR to create 3D casino floors where you can walk around as an avatar and chat with other players via voice. The Pros: Social Connection: It turns solo gaming into a social hangout, which is a big deal for the \"social casino\" vibe. New Revenue: Operators are looking at selling digital \"extras\" (like avatar skins or VIP table access) rather than just coin packs. Better Data: They can track exactly what players look at and interact with in a 3D space to tweak the games. The Reality Check: The article is pretty honest about the hurdles. Most people don't own high-end VR headsets yet, and \"tech nausea\" (motion sickness) is still a thing. Plus, it’s expensive for devs to build these worlds, and if the player base isn't there, the ROI is shaky. Verdict: It's likely not going to replace your mobile sweepstakes apps anytime soon because of the \"convenience factor,\" but we’ll probably see more hybrid AR (Augmented Reality) features popping up first since everyone already has a smartphone. TL;DR: VR is definitely coming to sweepstakes for the \"wow\" factor, but hardware costs mean it'll stay a niche for a while. Source - https://www.gammasweep.com/will-vr-find-a-role-in-sweepstakes-based-games/ submitted by /u/Superb_Drama_2765 to r/Igamingworld [link] [comments]",
      "link": "https://www.reddit.com/r/Igamingworld/comments/1qdetll/will_vr_actually_change_sweepstakes_gaming_or_is/",
      "author": "/u/Superb_Drama_2765",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.222194"
    },
    {
      "id": "https://www.reddit.com/t5_3jd48",
      "type": "search",
      "subreddit": "HowToMakeMoneyAsAKid",
      "title": "Money",
      "content": "This page is all about ways ages 7-16 can make money. Other people make suggestions, tips and even ask questions [link]",
      "link": "https://www.reddit.com/r/HowToMakeMoneyAsAKid/",
      "author": "/u/CarterMurphyTec",
      "search_keyword": "how to make a game",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.222253"
    }
  ],
  "last_updated": "2026-01-15T09:32:09.064498"
}