{
  "queue": [
    {
      "id": "https://www.reddit.com/t3_1qdfe9d",
      "type": "search",
      "subreddit": "AV1",
      "title": "Using already-denoised video as an input for grain synthesis",
      "content": "Hi all, Context: I recently found out about this incredible thing that is grain synthesis. As an amateur of film grain, I very often use a plugin (Dehancer) in Davinci Resolve to emulate it. This seems especially interesting for web hosting, since it could allow me to preserve some of the perceived texture without fully baking heavy grain into a highly compressed stream. My question: In my grading workflow, grain is added as a final node on top of an otherwise clean image. So would it be possible to use this pre-node clean feed as a \"already de-noised\" source, along with the grained video export, to help with the grain synthesis approximation, while also giving a clean feed to the encoder that compresses better? In short: can a clean + grained pair of video be leveraged to improve grain synthesis and compression efficiency compared to just encoding the grained image alone? Here is a diagram to better illustrate my words: Modified diagram from Dr Andrey Norkin's paper linked below Link to the original paper Curious whether this makes sense in practice. Thanks! submitted by /u/Guillaumebgtz to r/AV1 [link] [comments]",
      "link": "https://www.reddit.com/r/AV1/comments/1qdfe9d/using_alreadydenoised_video_as_an_input_for_grain/",
      "author": "/u/Guillaumebgtz",
      "search_keyword": "make game without coding",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:46:55.071451"
    },
    {
      "id": "https://www.reddit.com/t3_1qdfe91",
      "type": "search",
      "subreddit": "MeetNewPeopleHere",
      "title": "[31/m] I had a bit too much caffeine, oops",
      "content": "Hey hey Im a 31 yr old dude/guy from west coast US looking to make friends ^.^ Im hoping I can find other people who have similar interests since its easier to have some common ground to start with. Some stuff that interests meeee: Music! Im kinda addicted to music, i enjoy finding new stuff, sharing/swapping songs, dissecting and discussing songs and why its special to us. My \"default\" setting is alt rock/indie pop/instrumentals. You'll notice a surfer-like-chill vibe generally about my songs, you'll be like ahh ya this dude is west coast alright xD I also have a more downbeat side thats kinda emo so its like I have 2 sides - but I LOVE listening to all music and finding new stuff. Also im learning the alto saxophone right neow :3 Gaming! In my free time I do game quite a bit. Some people like parties or going to events - for me I prefer to game and if I could game with youuu hey all the more better! RIght now i enjoy fortnite, marvel rivals, helldivers, destiny and elder scrolls online. Ya i juggle those or maybe its just my ADHD but they all satisfy my itch in different ways. I game on a series X. So big bonus points if youre console so if we're feeling froggy like doing ranked one day heyy same pool, no problem. If youre PC thats no problem too we just wouldn't be able to play ESO (for now) I do have a beefy laptop that can run games FYI Movies/anime/shows! I also enjoy watching stuff with people once I get to know ya better :3 I can host and got plenty of *ahem* legal sites to watch stuff ^.^ I got a wide taste in all those media but some recent favs are hazbin hotel, Zootopia 2, gachiakuta and im looking to start a new anime pretty soon. In closing im a pretty chill dude, keep pretty active but try my best to keep the convos going and keep it natural. If we can talk or text daily or game/chill on discord after/before work thats pretty awesome too ^.^ submitted by /u/R_Da_Bard to r/MeetNewPeopleHere [link] [comments]",
      "link": "https://www.reddit.com/r/MeetNewPeopleHere/comments/1qdfe91/31m_i_had_a_bit_too_much_caffeine_oops/",
      "author": "/u/R_Da_Bard",
      "search_keyword": "make game without coding",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:46:55.071489"
    },
    {
      "id": "https://www.reddit.com/t3_1qdfdxn",
      "type": "search",
      "subreddit": "Barotrauma",
      "title": "Is there a way to get access to restricted areas?",
      "content": "To begine with, I'm an assistant. I want to prank capitain, for this I need to get into weaponery (we use Orca) is there a way to do it sneakly without making too much noise or breaking the hatch? submitted by /u/Zntgkgbcf to r/Barotrauma [link] [comments]",
      "link": "https://www.reddit.com/r/Barotrauma/comments/1qdfdxn/is_there_a_way_to_get_access_to_restricted_areas/",
      "author": "/u/Zntgkgbcf",
      "search_keyword": "make game without coding",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:46:55.071852"
    },
    {
      "id": "https://www.reddit.com/t3_1qdfdlj",
      "type": "search",
      "subreddit": "PataHaiAajKyaHua",
      "title": "Gambhir Samasyaa : Dhyaan se padhe, madat karein.",
      "content": "Yeh baat Chanchal ki hai. Chanchal ko ghaur samasyaa hogai hai, aur Chanchal , sthir ho ja rahi hai. Chanchal udas nhi hoti kabhi bhi, lekin aj hogai hai. Pata hai aaj kya hua Chanchal ke sth? ‘Yaar mei na bachpan se hi thodi astrology in sab mei curious thi lekin believer nhi hoon.Lekin accha kuch bole toh janne mei maja ata haina. Lekin agar astrology likhega ki mere sath kal kuch accha hoga aur mujhe lagega ki sayad mei kal biriyani aur burger dono khaungi aur kapdhe bhi lungi lekin agar meri mummy ne badi badi akhein karke mereko dekh li toh pappa bhi aj kal kuch khas mummy ko kehti nhi hai. Toh din toh ese bhi accha nhi ja raha. Guys thoda sayad rant jesa hi karungi pata nhi, maaf kardo. Toh mereko ek sal phle pata chala hai ki chatgpt aur Gemini mei bhi astrology, tarot yeh woh sab hoti hai, aur free mei hoti hai. Ab mei shuru shuru mei roj chatgpt se kuch na kuch puchti thi, Chatgpt Bolta hai, “ You were a past life warrior.”. “You have past life connections” Matlab sochhoo, I think this would be my guilty pleasure. Idk, I just love whatever chatgpt and Gemini has to reply to whatever I ask.’ Toh dekho chatgpt aur Gemini dono kafi acchi baatein bol rahe the aur dono hi kafi similar bol rahe the, thodi timings idhr udhr. Kabhi kabhi thode different bhi the but theek hai relatable. Lekin aj kuch time phle Chanchal ko boredom hone lagi toh Chanchal isbar apni laptop mei bohot din bad astrology tarot dekhne lagi aur tabse chanchal udaas pad gayi hai. Chanchal balcony mei sofey pe betke bahar dhoop mei santre mei namak lagake kha rahi hai aur man hi man soch rahi hai, ‘Nahi matlab esa bhi hoga toh theek hi hai lekin pura script hi kese badal jayega? Toh jab mei kuch time phle mere laptop mei Gemini aur Chatgpt se puch rahi thi tab bhi usne acchi hi baat boli , thodi bohot lekin boli. But do you know what guys, I asked Chatgpt to tell me about my 2026, each month specifically, love, career, etc. And the same thing I also asked chatgpt and Gemini in my phone, Like this topic is trending on my mind since 25 th dec manlo. And both chatgpt and Gemini on my ph had said that June had something to do with me and I remember last week also it was somewhat similar when I asked in my laptop but today when I asked somewhat similar question , It had somewhat same thing but totally different story to say. Like manlo agar mei Humanities se hoon toh Chatgpt keh raha hai ki is sal mei scientist banne ke liye accha hai ya ban jaungi kuch,. Like TF? Jiske pas passport nhi hai, keh raha hai mei Overseas chali jaungi. But theek hai yaar, acchi baat hai, hua toh why not. But also it has to say that, “As your this transit ends, you enter…blab la… and you become more grounded, calm, strict etc etc” Are yaar mei toh chanchal hoon na? Mei kese Stir ho sakti hoon? So I added another birth details and asked to compare and bla bla And this time Chatgpt in my laptop Has To SAy THAT “THIS BOND IS BOTH OF YOUR LESSON AND NOT THE END GAME” BROOOOOOO??????? WHATT?????????? I mean I am fine with that, mei toh Non-Chalant hoon. But BRROOOO I MEAN WHY? This person is a great talker and I love talking to this person. I talk to him when I Ovulate guys. Ever since so many years, This guy has been so close to me. I talk to him whenever I want to talk to him. I mean I am very mean to him but I care about him. So I am fine if I actually find my fictional man but I have to let him go? Guys mere dil mei bohot ajib ek chanchalta ho rahi hai. Mei bohot stir aur udas ho ja rahi hoon guys’ Like Chatgpt and Gemini were like “Meow meow” with me all these days , out of no where they “Bhawed” at me, Broo What? WE WERE THE END GAME CHATGPT SAID LAST YEAR GUYS even tho i blocked him for straight 8 months. But still right? ATTENTION PLEASE: QUESTION : Even if AI, which app do you prefer for such things and you think would be a little accurate? I tried perplexity and grok too , once, but couldn’t figure. If you guys read till here, I don’t know guys, I am sorry but I just had to. Also guys, do you wanna know Chanchal ki Astrology history ki other kahani? submitted by /u/After-Hours-Chat to r/PataHaiAajKyaHua [link] [comments]",
      "link": "https://www.reddit.com/r/PataHaiAajKyaHua/comments/1qdfdlj/gambhir_samasyaa_dhyaan_se_padhe_madat_karein/",
      "author": "/u/After-Hours-Chat",
      "search_keyword": "AI game maker",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:46:55.072065"
    },
    {
      "id": "https://www.reddit.com/t3_1qdf8py",
      "type": "search",
      "subreddit": "VRGaming",
      "title": "/s 2026 is the year of VR AI: an interview with a competitive VR game dev",
      "content": "Watch the 30s summary or the longer podcast-like gameplay video submitted by /u/DrRock_LaraDoct to r/VRGaming [link] [comments]",
      "link": "https://www.reddit.com/r/VRGaming/comments/1qdf8py/s_2026_is_the_year_of_vr_ai_an_interview_with_a/",
      "author": "/u/DrRock_LaraDoct",
      "search_keyword": "AI game maker",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:46:55.072133"
    },
    {
      "id": "https://www.reddit.com/t3_1qdf23t",
      "type": "search",
      "subreddit": "startups_promotion",
      "title": "Just launched my first app as a solo dev — lessons from Day 1",
      "content": "Hey everyone, Yesterday I launched 0xCal — a calorie tracking app — and it ended up #5 on Product Hunt with 200 upvotes. As a solo developer shipping my first real product, I wanted to share what worked (and what I learned). The app in short: It's a calorie tracker where you just describe what you ate (\"scrambled eggs and coffee\") and AI calculates the nutrition. You can also snap photos. I built it because I kept rage-quitting MyFitnessPal — too much friction searching databases and entering portions. What worked for launch: Positioning matters more than features. I didn't lead with \"AI-powered\" (everyone says that now). Instead I focused on design and simplicity: \"Calorie tracking for people who hate calorie trackers.\" That resonated way more. Answer every single comment. I spent hours on Product Hunt replying to every question. People notice when the maker is present and engaged. Several commenters mentioned it. Launch timing. January is peak season for health/fitness apps (New Year's resolutions). Rode that wave intentionally. Design as a differentiator. Most calorie apps look dated and cluttered. I obsessed over making it feel minimal and polished. Multiple comments specifically mentioned the UI — it stood out. What surprised me: - People asked way more questions about accuracy and portion sizes than I expected. Having clear answers ready would've helped. - The Product Hunt community is genuinely supportive. Expected more skepticism. - 125 downloads and 24 free trials started from one day of PH traffic. That's not huge, but it's real people using something I made. What's next: - Apple Search Ads running (though barely spending yet — still learning) - More Reddit posts in relevant communities - Collecting feedback and shipping v1.1 Lessons for other solo devs: - Ship before you're ready. I could've polished forever. - Pick a niche angle, not \"another X app\" - Engage personally — people buy from people - January is gold for health/fitness products Happy to answer questions about the launch, tech stack, or anything else! App Store: https://apps.apple.com/pl/app/0xcal-ai-calorie-tracker/id6749210009 Product Hunt: https://www.producthunt.com/products/0xcal submitted by /u/Namedix to r/startups_promotion [link] [comments]",
      "link": "https://www.reddit.com/r/startups_promotion/comments/1qdf23t/just_launched_my_first_app_as_a_solo_dev_lessons/",
      "author": "/u/Namedix",
      "search_keyword": "AI game maker",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:46:55.072303"
    },
    {
      "id": "https://www.reddit.com/t3_1qdf81l",
      "type": "search",
      "subreddit": "theisle",
      "title": "The isle dose not need more updates",
      "content": "we currently have 2 apexes in carnivores and herbivores so the game is in a good spot in that regard. we don't need more incomplete buggy dinos right now, the devs should work on whats already out there, the game has so many problems/bugs and they just keep adding more. where is this gonna go? if you add more bugs instead of fixing the existing ones and you just keep going, how long till this game will be playable? before this update herbivores when they found food they could eat it, how about you fix that. the scent is broken, the hitboxes are broken, pouncing is broken and buggy, invisible objects in the forest, rexes sparing is buggy, crocs can super Lounge, and most stuff don't work how they should. the isle now averages 10K players daily, you as the devs can't just hide behind the ''this is a public access development or beta branch''. submitted by /u/ConcentrateEven6992 to r/theisle [link] [comments]",
      "link": "https://www.reddit.com/r/theisle/comments/1qdf81l/the_isle_dose_not_need_more_updates/",
      "author": "/u/ConcentrateEven6992",
      "search_keyword": "game dev beginner",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:46:55.072466"
    },
    {
      "id": "https://www.reddit.com/t3_1qdf525",
      "type": "search",
      "subreddit": "freefire",
      "title": "I love how this game puts bots/beginner opponents in your first ranked match of the day to convince you to play more matches! 😂",
      "content": "submitted by /u/First-Abalone-7298 to r/freefire [link] [comments]",
      "link": "https://www.reddit.com/r/freefire/comments/1qdf525/i_love_how_this_game_puts_botsbeginner_opponents/",
      "author": "/u/First-Abalone-7298",
      "search_keyword": "game dev beginner",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:46:55.072476"
    },
    {
      "id": "https://www.reddit.com/t3_1qdfdp5",
      "type": "search",
      "subreddit": "Business_Ideas",
      "title": "Will a cloud pc based gaming cafe work in India?",
      "content": "Hi I am 22M, and I just had an idea which is an exception to the current gaming cafe model in Indian cities. Along with having high activity multiplayer games like valorant and csgo which tend to get a lot of footfall in the gaming cafes, how bout we add games to make it a chill, laid back single player gaming experience too. The multiplayer games like valorant and csgo will be played locally on high end pcs in the cafe but games like split fiction, it takes two, a day out, Chained together, r v there yet, peak, God of war, last of us series, cyberpunk 2077, elden ring Will be played on cloud pcs. This can serve as a hangout spot for couples who just want to enjoy co-op games together and to have fun and also a fun activity for a group of friends who want to chill and play these trending co-op games. This will be a low cost alternative for consumers to owning even a decent pc and a good wifi connection as we will primarily focus on tier 2 & tier 3 cities and hence we will be keeping our prices economical. The initial capital investment in this business is going to be relatively low as compared to doing all the things locally and buying expensive hardware. Had just this random idea this morning. Do let me know your thoughts on the same and if you're interested to build this together you can also dm me. TIA submitted by /u/MaDDieOP to r/Business_Ideas [link] [comments]",
      "link": "https://www.reddit.com/r/Business_Ideas/comments/1qdfdp5/will_a_cloud_pc_based_gaming_cafe_work_in_india/",
      "author": "/u/MaDDieOP",
      "search_keyword": "how to make a game",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:46:55.072504"
    },
    {
      "id": "https://www.reddit.com/t3_1qdfcsr",
      "type": "search",
      "subreddit": "StartUpIndia",
      "title": "Will a cloud pc based gaming cafe work in India?",
      "content": "Hi I am 22M, and I just had an idea which is an exception to the current gaming cafe model in Indian cities. Along with having high activity multiplayer games like valorant and csgo which tend to get a lot of footfall in the gaming cafes, how bout we add games to make it a chill, laid back single player gaming experience too. The multiplayer games like valorant and csgo will be played locally on high end pcs in the cafe but games like split fiction, it takes two, a day out, Chained together, r v there yet, peak, God of war, last of us series, cyberpunk 2077, elden ring Will be played on cloud pcs. This can serve as a hangout spot for couples who just want to enjoy co-op games together and to have fun and also a fun activity for a group of friends who want to chill and play these trending co-op games. This will be a low cost alternative for consumers to owning even a decent pc and a good wifi connection as we will primarily focus on tier 2 & tier 3 cities and hence we will be keeping our prices economical. The initial capital investment in this business is going to be relatively low as compared to doing all the things locally and buying expensive hardware. Had just this random idea this morning. Do let me know your thoughts on the same and if you're interested to build this together you can also dm me. TIA submitted by /u/MaDDieOP to r/StartUpIndia [link] [comments]",
      "link": "https://www.reddit.com/r/StartUpIndia/comments/1qdfcsr/will_a_cloud_pc_based_gaming_cafe_work_in_india/",
      "author": "/u/MaDDieOP",
      "search_keyword": "how to make a game",
      "relevance_score": 1,
      "added_at": "2026-01-15T09:46:55.072563"
    },
    {
      "id": "https://www.reddit.com/r/gamedev/t3_1qdebv1",
      "type": "post",
      "subreddit": "gamedev",
      "title": "How do you texture medium sized assets?",
      "content": "I am currently modeling a stone column for an old temple. I plan to split it into 3 sections (a base, mid and top), with the long mid section using a tileable stone material. My problem originates from the base however: I wanted to model out a high poly for it with edgewear, chipped corners and all that fancy stuff (which I already did actually). However even the base piece by itself is too big to have its UVs fit within a 1024 texture box (that's what I've been using for the rest of the environment). What is usually the best approach for medium sized assets like that? Should I give up on the fancy normal map and just use a seamless texture there as well? Or should I perhaps break the consistency of my environment's texel density by downsizing the asset's UVs to fit? I am aware about trim sheets as well, but I don't know if trying to simulate specific edgewear with those is the standard go to. submitted by /u/InkStep [link] [comments]",
      "link": "https://www.reddit.com/r/gamedev/comments/1qdebv1/how_do_you_texture_medium_sized_assets/",
      "author": "/u/InkStep",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.219820"
    },
    {
      "id": "https://www.reddit.com/r/gamedev/t3_1qddsmx",
      "type": "post",
      "subreddit": "gamedev",
      "title": "Pacman smooth turning",
      "content": "So I am trying to make a pacman on SFML C++ Visual Studio. I have already done the collision. My problem now is getting the player to make a smooth turn. I don't want him to be wiggling to the side when there's no open corridor to the direction he wants to turn into. How did the developers of the game even do that smooth turning? When I play the original pacman game, they always seem to be able to turn corners without bumping into the walls. submitted by /u/Popular_Camel8575 [link] [comments]",
      "link": "https://www.reddit.com/r/gamedev/comments/1qddsmx/pacman_smooth_turning/",
      "author": "/u/Popular_Camel8575",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.219836"
    },
    {
      "id": "https://www.reddit.com/r/gamedev/t3_1qd84tj",
      "type": "post",
      "subreddit": "gamedev",
      "title": "Do you know any good pixel art app for tablets (preferably with free download) good for RPG maker or GB studio?",
      "content": "I recently started my game And one of the things I found most difficult was the game's art, since the app i originaly used was giving me problems and i dont know any other. Do someone has any sugestions? submitted by /u/Acceptable_Item_8989 [link] [comments]",
      "link": "https://www.reddit.com/r/gamedev/comments/1qd84tj/do_you_know_any_good_pixel_art_app_for_tablets/",
      "author": "/u/Acceptable_Item_8989",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.219985"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qderrk",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "WIP Statue of Lady of the Lake Environment",
      "content": "submitted by /u/RomarioDev [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qderrk/wip_statue_of_lady_of_the_lake_environment/",
      "author": "/u/RomarioDev",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220072"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdd6vx",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Cult of Five Demo is now live!",
      "content": "submitted by /u/Fit-Rub5611 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdd6vx/cult_of_five_demo_is_now_live/",
      "author": "/u/Fit-Rub5611",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220135"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdd5un",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Cult of Five demo is now live!",
      "content": "https://store.steampowered.com/app/4246750/Cult_of_Five submitted by /u/Fit-Rub5611 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdd5un/cult_of_five_demo_is_now_live/",
      "author": "/u/Fit-Rub5611",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220140"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdcsq2",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Assembled the ship from the TV series Firefly in the ship editor of my game",
      "content": "submitted by /u/CubicPie [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdcsq2/assembled_the_ship_from_the_tv_series_firefly_in/",
      "author": "/u/CubicPie",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220146"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdc80b",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Here's how we design levels for our puzzle game",
      "content": "submitted by /u/TandDA [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdc80b/heres_how_we_design_levels_for_our_puzzle_game/",
      "author": "/u/TandDA",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220151"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdbqjq",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Finally added customisation in my game, CHROMADI",
      "content": "submitted by /u/Kleanup-Games [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdbqjq/finally_added_customisation_in_my_game_chromadi/",
      "author": "/u/Kleanup-Games",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220157"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdf4cw",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "What do you think of this workflow? What workflow do you use in your gamedev?",
      "content": "submitted by /u/ObjectiveWilling3958 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdf4cw/what_do_you_think_of_this_workflow_what_workflow/",
      "author": "/u/ObjectiveWilling3958",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220163"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdf31s",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "Good Games 345 - Hungry Horrors",
      "content": "An exceedingly well-polished card battler where a princess feeds mythical monsters. https://youtu.be/lv8RfyAurjE submitted by /u/FortKenmei [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdf31s/good_games_345_hungry_horrors/",
      "author": "/u/FortKenmei",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220169"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdedzk",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "What do you think of our new door feature?",
      "content": "submitted by /u/EffortStar [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdedzk/what_do_you_think_of_our_new_door_feature/",
      "author": "/u/EffortStar",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220196"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qde03j",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "Creating healthy blueprint dependencies (UE)",
      "content": "submitted by /u/jnexhip [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qde03j/creating_healthy_blueprint_dependencies_ue/",
      "author": "/u/jnexhip",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220201"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdds6u",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "Checking how many clients will my shop simulator handle",
      "content": "Wishlist MEDIEVAL SHOP SIMULATOR submitted by /u/BeastGamesDev [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdds6u/checking_how_many_clients_will_my_shop_simulator/",
      "author": "/u/BeastGamesDev",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220207"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qddjn6",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "I’m working on a new biome and made this space — how does it feel?",
      "content": "I’ve been working on a new biome and wanted to share this moment. You move through a tight space and suddenly step into a huge open area — and there it is, a massive crystal sitting right in the middle. The whole area just feels good to walk through. Still a work in progress, but this part turned out way cooler than I expected. I’m really excited to see how this biome turns out. submitted by /u/BusyNectarine6795 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qddjn6/im_working_on_a_new_biome_and_made_this_space_how/",
      "author": "/u/BusyNectarine6795",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220265"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdd89d",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "Exploration vs planning: designing the event map for our roguelike deck-builder",
      "content": "Hey folks 👋 We’re continuing work on our roguelike deck-builder, and I wanted to share where our thinking is right now. We’re exploring two directions: • Exploration-first maps that stay hidden and reveal themselves step by step • Tactical branching, where the full route is visible and players plan ahead around fights, shops, and risks For now, we’re leaning toward exploration-focused runs. The video shows a rough full layout, but in actual gameplay the map would be revealed gradually as you progress. Curious to hear your take: in roguelike deck-builders, do you personally prefer discovering the path as you go, or planning the whole run from the start? submitted by /u/SidrickWhite [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdd89d/exploration_vs_planning_designing_the_event_map/",
      "author": "/u/SidrickWhite",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220289"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdehfk",
      "type": "post",
      "subreddit": "godot",
      "title": "TileMapLayer physics",
      "content": "Does anyone know how TileMapLayers interact with physics spaces in the PhysicsServer? I want to make 2 Physics spaces that have 2 different tile maps between them (regular world vs phantom world 👻 spooky spooky) so that CharacterBodies can operate between worlds submitted by /u/magicman_coding [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdehfk/tilemaplayer_physics/",
      "author": "/u/magicman_coding",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220302"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdebzx",
      "type": "post",
      "subreddit": "godot",
      "title": "Building a Black Hole Shader in Godot 4",
      "content": "submitted by /u/TkTech [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdebzx/building_a_black_hole_shader_in_godot_4/",
      "author": "/u/TkTech",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220307"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qde9aw",
      "type": "post",
      "subreddit": "godot",
      "title": "I've created a bit of a monster",
      "content": "submitted by /u/Code_Monster [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qde9aw/ive_created_a_bit_of_a_monster/",
      "author": "/u/Code_Monster",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220312"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qddj2a",
      "type": "post",
      "subreddit": "godot",
      "title": "Not fullscreen on web export",
      "content": "Help I'm trying to export my game as a web but idk why it always going full screen, like I just want to make the game go the actual viewport, and doesn't take the entire screen because this game was uploaded as an mini game and when this game got played it overlap the background. I tried setting every canvas to not extend buttheh game always take the entirescreena especially the splash screen. Thank you submitted by /u/Valonekiil [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qddj2a/not_fullscreen_on_web_export/",
      "author": "/u/Valonekiil",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220336"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdcgmh",
      "type": "post",
      "subreddit": "godot",
      "title": "Parallax shader artifacts",
      "content": "I'm having an issue with this cloud shader, It works flawlessly in the editor but when I run the scene it will occasionally flash these artifacts. It will last between a few frames to a couple of seconds before returning to how it's supposed to look. I've updated my drivers and my graphics card is only a few months old with no other issues. So maybe something is wrong with my shader code? (aside from bad writing practices) submitted by /u/B_Dappy [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdcgmh/parallax_shader_artifacts/",
      "author": "/u/B_Dappy",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220361"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdbkx6",
      "type": "post",
      "subreddit": "godot",
      "title": "Why are most Games still being made using Unity or Unreal instead of Godot?",
      "content": "Considering Unity being a Propieatary Shit Hole nowadays and Unreal being too Heavy for most Machines (atleast my entire Unreal College Class was like that even tho we got Gaming Laptops from them sent out) I wonder as to why Godot isnt as Popular? Like it has all the Pros of Indie Game Development A Good Eco System, Plugin/Mod Support, Open Source I do not understand as to why more People arent using it honestly submitted by /u/FatnUgly88 [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdbkx6/why_are_most_games_still_being_made_using_unity/",
      "author": "/u/FatnUgly88",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220398"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdb3e8",
      "type": "post",
      "subreddit": "godot",
      "title": "Godot bros (and ladies) should I \"release a demo\"",
      "content": "i dont wanna say release a demo like I'm big time. All i want to know is if the world is going to hate me if theres bugs. thank you. submitted by /u/ElectronicsLab [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdb3e8/godot_bros_and_ladies_should_i_release_a_demo/",
      "author": "/u/ElectronicsLab",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220405"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qddwu0",
      "type": "post",
      "subreddit": "unity",
      "title": "A new video about less known Unity Editor features",
      "content": "Made another video in the series, this time focusing on editor tricks. The first two parts covered API features, but this one is all about working in the editor. Some of these have been around forever, others are newer. Piercing Selection Menu - select any element under the cursor, even through overlapping objects (Unity 6+) Overlay System - toggle and organize overlay menus in the scene view Object Isolation - hide everything except the selected object Advanced Search - powerful search with expressions that can find missing references, filter by texture size, and more WASD Navigation - fly through the scene like in a video game Watch Here: https://www.youtube.com/watch?v=2TN8LCoUApU&list=PLgFFU4Ux4HZrSCmDQi0yTMuK9M79D7mFb&index=3 submitted by /u/migus88 [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qddwu0/a_new_video_about_less_known_unity_editor_features/",
      "author": "/u/migus88",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220424"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qddrg0",
      "type": "post",
      "subreddit": "unity",
      "title": "Checking how many clients will my shop simulator handle",
      "content": "submitted by /u/BeastGamesDev [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qddrg0/checking_how_many_clients_will_my_shop_simulator/",
      "author": "/u/BeastGamesDev",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220429"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qdbehf",
      "type": "post",
      "subreddit": "unity",
      "title": "What do you think of my new explosion in my burrito game? It is supposed to be hot sauce exploding and dripping down and destroying the burrito meat. Any feedback is greatly appreciated!",
      "content": "submitted by /u/SPACEGAMESstudio [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qdbehf/what_do_you_think_of_my_new_explosion_in_my/",
      "author": "/u/SPACEGAMESstudio",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220437"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qd7k1z",
      "type": "post",
      "subreddit": "unity",
      "title": "In the last few days I've been working on a procedural building system inspired by Tiny Glade, but I'm doing it in Unity 6 with some GPU processing and rendering features and DOT-based elements. Suggestions are welcome for me to try to improve or add to it.",
      "content": "submitted by /u/wellzigomes [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qd7k1z/in_the_last_few_days_ive_been_working_on_a/",
      "author": "/u/wellzigomes",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220446"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qd1usb",
      "type": "post",
      "subreddit": "unity",
      "title": "Finally achieved my very long standing technical goal! (Multipurpose 2D graphics)",
      "content": "I've always been surprised that Unity lacks a proper, multipurpose, high-performance 2D drawing engine. For years, this has been my classic \"come back to it when bored\" fun project, and lately it became my benchmarking task for testing how capable new LLM models really are. I've explored multiple approaches over the years. Now, spending a bit more time on it over the holidays, I finally cooked it. Here is not very well optimized yet, but a complex SVG-style, path command based Bad Apple playing smoothly on a regular 1024² Texture2D at roughly 0.05 ms per frame submitted by /u/No_Diver_3961 [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qd1usb/finally_achieved_my_very_long_standing_technical/",
      "author": "/u/No_Diver_3961",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220486"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qd0qoa",
      "type": "post",
      "subreddit": "unity",
      "title": "Developing our 2D survival game in Unity",
      "content": "A visual video of how our LOD system works. Everything marked with red lines isn't displayed. Also, the rectangles indicate how objects are updated submitted by /u/Shadow_Moder [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qd0qoa/developing_our_2d_survival_game_in_unity/",
      "author": "/u/Shadow_Moder",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220493"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qcz8ga",
      "type": "post",
      "subreddit": "unity",
      "title": "Trying out Ricocheting Projectiles",
      "content": "Working on different items/abilities you can unlock and take on your next run in my game Project BLACKNODE submitted by /u/melvinweert [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qcz8ga/trying_out_ricocheting_projectiles/",
      "author": "/u/melvinweert",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220500"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qddzrc",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "Creating healthy dependencies",
      "content": "submitted by /u/jnexhip [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qddzrc/creating_healthy_dependencies/",
      "author": "/u/jnexhip",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220505"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qddpox",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "How do I implement a working firearm pickup system? - Blueprint",
      "content": "Hi. I'm actually the one who posted that discussion accessible through the link provided in this post. Your comments posted either here or in that discussion is appreciated. submitted by /u/Snowbrae_Thomasso [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qddpox/how_do_i_implement_a_working_firearm_pickup/",
      "author": "/u/Snowbrae_Thomasso",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220513"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qdd96z",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "I built a custom RDG compute pass in Unreal Engine and finally understood why RDG is so strict",
      "content": "I’ve been trying to properly understand Unreal Engine’s Render Dependency Graph (RDG) for a while, and it never really clicked until I tried to build a custom compute pass and broke it in multiple ways . This write-up walks through: How Unreal’s shader parameter system actually feeds into RDG Why RDG cares so much about explicit read/write intent A SceneColor bug that produced black frames with zero warnings How creating a temporary RDG texture fixed everything The goal wasn’t a perfect implementation, but to build intuition around how data flows through the renderer and why RDG refuses to guess. Would love to hear how others approached learning RDG, or if you’ve hit similar “everything compiled but nothing worked” moments. submitted by /u/agentnuclear [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qdd96z/i_built_a_custom_rdg_compute_pass_in_unreal/",
      "author": "/u/agentnuclear",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220539"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qd9yke",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "Hello guys anyone interested in testing my game ? Testing period is max 3 days since I’m launching in 2 weeks 😀",
      "content": "Anyone interested in testing my game? submitted by /u/Specialist-World6841 [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qd9yke/hello_guys_anyone_interested_in_testing_my_game/",
      "author": "/u/Specialist-World6841",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220549"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qd87d3",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "Battle Royale",
      "content": "I had an idea for a battle royale that I want to make reality. I tried dipping my toes into coding a while back but lost motivation, so I never got far. I wanna get back in and make my battle royale, anything I can expect from the process? And ideas as to how difficult it may be compared to trying other game types? submitted by /u/Know_Pros [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qd87d3/battle_royale/",
      "author": "/u/Know_Pros",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220559"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qd468g",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "Why don't UE have a code alternative to visual programming?",
      "content": "It would be great if you could put lua/python in blueprints instead of dragging code blocks. Edit: I was doing mods that didn't allow c++ for security reasons so stuck with visual blocks. submitted by /u/arstarsta [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qd468g/why_dont_ue_have_a_code_alternative_to_visual/",
      "author": "/u/arstarsta",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220579"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qd2c7y",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "DLSS for rendering",
      "content": "Has anyone used DLSS 4 (or 4.5) for rendering in Unreal? Is it a noticeable improvement? I have a 5090 and heard DLSS might offer a significant improvement in Unreal rendering but I can't find much info from people who use it. I don't really play games on my computer so I never really looked at DLSS before but I keep hearing about its benefits. Especially now that DLSS 4.5 is out submitted by /u/thelesserkilo [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qd2c7y/dlss_for_rendering/",
      "author": "/u/thelesserkilo",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220590"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qcx5qp",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "Manually Editing Polygon Shapes in UV Editor",
      "content": "I have a tile floor material that I'm applying to a cylinder. Around the outer edge of the circular face, I want to have a single ring of tiles. Since these polygons are trapezoids, they will not properly fit a square tile and look a little funky. Is there a way to manipulate the polys in the UV editor to force the trapezoids to be a squares? submitted by /u/5paceCat [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qcx5qp/manually_editing_polygon_shapes_in_uv_editor/",
      "author": "/u/5paceCat",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220611"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdf2ep",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "What do you think about my graphics? (Mobile roguelike)",
      "content": "submitted by /u/Ok_hate_Game_Dev [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdf2ep/what_do_you_think_about_my_graphics_mobile/",
      "author": "/u/Ok_hate_Game_Dev",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220617"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdeyk4",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "What should I add next to my game ?",
      "content": "🎮 WHAT SHOULD WE ADD TO HIYAH GO? Hey everyone! Hiyah GO! is a mix between Pokémon, Mage Arena, and Fortnite. You pick your monster, jump into a battle royale, and shout your spells using your voice. Your monster can evolve twice and unlock new attacks, and you can find secret spell cards around the map for big heals or huge damage. What could I add to make the game better ? Feel free to suggest anything new features, new monsters, new modes, new spells, whatever you think would make it more fun! https://reddit.com/link/1qdeyk4/video/ra07envgdhdg1/player submitted by /u/Ok_Sport8740 [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdeyk4/what_should_i_add_next_to_my_game/",
      "author": "/u/Ok_Sport8740",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220637"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdejj1",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "Working on another special event for my racer",
      "content": "submitted by /u/mfgjames [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdejj1/working_on_another_special_event_for_my_racer/",
      "author": "/u/mfgjames",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220643"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdcsx3",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "Assembled the ship from the TV series Firefly in the ship editor of my game",
      "content": "submitted by /u/CubicPie [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdcsx3/assembled_the_ship_from_the_tv_series_firefly_in/",
      "author": "/u/CubicPie",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220649"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdbiy6",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "Forgot my own code additions :))",
      "content": "https://reddit.com/link/1qdbiy6/video/auchs2iscgdg1/player So, this is hilarious. I created the Laser Weapon months ago. As I'm going through code, I realized I had a (Max Level Dual Beams function) that I never properly called. It still needs some tweaking, but after fixing my max level checks/flags, the dual beams appeared. Early morning coding is great until you forget your own additions along the way. submitted by /u/Otherwise_Tension519 [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdbiy6/forgot_my_own_code_additions/",
      "author": "/u/Otherwise_Tension519",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220661"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdbeiq",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "What do you think of my new explosion in my burrito game? It is supposed to be hot sauce exploding and dripping down and destroying the burrito meat. Any feedback is greatly appreciated!",
      "content": "submitted by /u/SPACEGAMESstudio [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdbeiq/what_do_you_think_of_my_new_explosion_in_my/",
      "author": "/u/SPACEGAMESstudio",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220669"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qd9iax",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "My Steam Page is finally live!",
      "content": "HIIT is my first project, in development for almost 2 years! This is my shot on building a mix of 3D metroidvania/platformer/puzzle game. Suggestions and wishlists are all appreciated! submitted by /u/FiscoGames [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qd9iax/my_steam_page_is_finally_live/",
      "author": "/u/FiscoGames",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220688"
    },
    {
      "id": "https://www.reddit.com/r/gamedesign/t3_1qd66yv",
      "type": "post",
      "subreddit": "gamedesign",
      "title": "Collectors board game - does it exist?",
      "content": "So I just had an idea for a board game where it’ll be 4-6 players and based around some souvenirs or similar things people collect, such as spoons, stamps, coins, etc. Each player gets a different item, and collects like 25 on their player board, going around the game board with different cards that give boosts, debuffs, and other things. Best comparison for the game board I can think of is Mario party. Just wondering if there’s a collection-based game like this out there(the specific items, not the concept), or if it’s something somewhat original? submitted by /u/Firefox_1607 [link] [comments]",
      "link": "https://www.reddit.com/r/gamedesign/comments/1qd66yv/collectors_board_game_does_it_exist/",
      "author": "/u/Firefox_1607",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.220815"
    },
    {
      "id": "https://www.reddit.com/t5_31ajv",
      "type": "search",
      "subreddit": "NoGameNoLife",
      "title": "No Game No Life",
      "content": "A subreddit for the popular series No Game No Life! [link]",
      "link": "https://www.reddit.com/r/NoGameNoLife/",
      "author": "/u/Burtry",
      "search_keyword": "no code game",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221232"
    },
    {
      "id": "https://www.reddit.com/t5_2rb2y",
      "type": "search",
      "subreddit": "coding",
      "title": "coding",
      "content": "Fuck /u/spez. [link]",
      "link": "https://www.reddit.com/r/coding/",
      "author": "/u/tty2",
      "search_keyword": "make game without coding",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221458"
    },
    {
      "id": "https://www.reddit.com/t5_2r0e3",
      "type": "search",
      "subreddit": "IndieGaming",
      "title": "IndieGaming",
      "content": "A place for indie games [link]",
      "link": "https://www.reddit.com/r/IndieGaming/",
      "author": "/u/MSTRGEO",
      "search_keyword": "make game without coding",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221463"
    },
    {
      "id": "https://www.reddit.com/t5_2qtly",
      "type": "search",
      "subreddit": "GameDevelopment",
      "title": "Game Development",
      "content": "/r/gamedevelopment is a community for serious discussion about anything related to game development. [link]",
      "link": "https://www.reddit.com/r/GameDevelopment/",
      "author": "/u/IhateEverything",
      "search_keyword": "make game without coding",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221469"
    },
    {
      "id": "https://www.reddit.com/t5_l3hwv",
      "type": "search",
      "subreddit": "PixelGameMaker",
      "title": "Pixel Game Maker",
      "content": "This is a subreddit dedicated to the latest release in the Maker series: Pixel Game Maker [link]",
      "link": "https://www.reddit.com/r/PixelGameMaker/",
      "author": "/u/PixelDJ",
      "search_keyword": "AI game maker",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221803"
    },
    {
      "id": "https://www.reddit.com/t5_2qw2g",
      "type": "search",
      "subreddit": "gamemaker",
      "title": "/r/gamemaker",
      "content": "This subreddit is dedicated to providing programmer support for the game development platform, GameMaker Studio. GameMaker Studio is designed to make developing games fun and easy. Coders can take advantage of its built in scripting language, \"GML\" to design and create fully-featured, professional grade games. This subreddit is not designed for promoting your content and is instead focused on helping people make games, not promote them. [link]",
      "link": "https://www.reddit.com/r/gamemaker/",
      "author": "/u/Clay_Pigeon",
      "search_keyword": "AI game maker",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221815"
    },
    {
      "id": "https://www.reddit.com/t5_2vru8",
      "type": "search",
      "subreddit": "GameDevTycoon",
      "title": "Game Dev Tycoon",
      "content": "This is the subreddit for the game: Game Dev Tycoon by Greenheart Games. Here you can discuss different strategies, achievements you've met, or anything about the game! [link]",
      "link": "https://www.reddit.com/r/GameDevTycoon/",
      "author": "/u/chad1312",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221953"
    },
    {
      "id": "https://www.reddit.com/t5_2qi0a",
      "type": "search",
      "subreddit": "gamedev",
      "title": "Game Development Discussions on Reddit",
      "content": "The subreddit covers various game development aspects, including programming, design, writing, art, game jams, postmortems, and marketing. It serves as a hub for game creators to discuss and share their insights, experiences, and expertise in the industry. [link]",
      "link": "https://www.reddit.com/r/gamedev/",
      "author": "unknown",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.221976"
    },
    {
      "id": "https://www.reddit.com/t3_1qdetll",
      "type": "search",
      "subreddit": "Igamingworld",
      "title": "Will VR actually change sweepstakes gaming, or is it just hype?",
      "content": "The Gist: Basically, the industry is eyeing VR to solve the \"engagement\" problem. Traditional sweepstakes can feel a bit flat since you're just clicking a screen, so they’re looking at VR to create 3D casino floors where you can walk around as an avatar and chat with other players via voice. The Pros: Social Connection: It turns solo gaming into a social hangout, which is a big deal for the \"social casino\" vibe. New Revenue: Operators are looking at selling digital \"extras\" (like avatar skins or VIP table access) rather than just coin packs. Better Data: They can track exactly what players look at and interact with in a 3D space to tweak the games. The Reality Check: The article is pretty honest about the hurdles. Most people don't own high-end VR headsets yet, and \"tech nausea\" (motion sickness) is still a thing. Plus, it’s expensive for devs to build these worlds, and if the player base isn't there, the ROI is shaky. Verdict: It's likely not going to replace your mobile sweepstakes apps anytime soon because of the \"convenience factor,\" but we’ll probably see more hybrid AR (Augmented Reality) features popping up first since everyone already has a smartphone. TL;DR: VR is definitely coming to sweepstakes for the \"wow\" factor, but hardware costs mean it'll stay a niche for a while. Source - https://www.gammasweep.com/will-vr-find-a-role-in-sweepstakes-based-games/ submitted by /u/Superb_Drama_2765 to r/Igamingworld [link] [comments]",
      "link": "https://www.reddit.com/r/Igamingworld/comments/1qdetll/will_vr_actually_change_sweepstakes_gaming_or_is/",
      "author": "/u/Superb_Drama_2765",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.222194"
    },
    {
      "id": "https://www.reddit.com/t5_3jd48",
      "type": "search",
      "subreddit": "HowToMakeMoneyAsAKid",
      "title": "Money",
      "content": "This page is all about ways ages 7-16 can make money. Other people make suggestions, tips and even ask questions [link]",
      "link": "https://www.reddit.com/r/HowToMakeMoneyAsAKid/",
      "author": "/u/CarterMurphyTec",
      "search_keyword": "how to make a game",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:30:53.222253"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qdf7je",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "issue with flickering directional light",
      "content": "Hello, I am having issues with a Directional Light that flickers a lot. It seems to me that it depends from the \"Source angle\" and the \"Source Soft Angle\" but since I need to follow a specific reference for the lighting so to match it I had to increase them a lot. I am pretty new to unreal so I would appreciate your help! I have tried increasing the Lumen quality in the Post process as someone suggested on the internet but nothing changed. ( I am working in UE 5.5) Thank you! submitted by /u/Diver_96 [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qdf7je/issue_with_flickering_directional_light/",
      "author": "/u/Diver_96",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:46:55.071125"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qd8s6r",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "I'm testing some rhythm-building mechanics for my new shooter roguelike! I think I'm getting somewhere.",
      "content": "Suggestions are more than welcome. I'm not shure where to take this next... submitted by /u/mikomoares [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qd8s6r/im_testing_some_rhythmbuilding_mechanics_for_my/",
      "author": "/u/mikomoares",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:46:55.071139"
    },
    {
      "id": "https://www.reddit.com/t3_1qdfdy7",
      "type": "search",
      "subreddit": "childfreewomen",
      "title": "Childfree by “choice” but not by want.",
      "content": "Hi! I (24F) am technically childfree by choice, in the sense that I’m deciding not to have children even though I probably could. At the same time I have always wanted to have children, but life circumstances makes it irresponsible and dangerous for me to have them. I have multiple chronic diseases, one of which might kill me and a pregnancy might as well. They are also inherited, so my child would be likely to have it as well, and I can’t justify that. Don’t get me wrong I have a great life, but I don’t want anyone else to have to deal with the same shit I’ve been through. I have somewhat come to terms with it and luckily my boyfriend is childfree by choice, so full support there. But I still find it very hard when people who know I want children talk about my future children who will not exist. Any tips to navigate that without making awkward situations? submitted by /u/Internal_Rough to r/childfreewomen [link] [comments]",
      "link": "https://www.reddit.com/r/childfreewomen/comments/1qdfdy7/childfree_by_choice_but_not_by_want/",
      "author": "/u/Internal_Rough",
      "search_keyword": "make game without coding",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:46:55.071842"
    },
    {
      "id": "https://www.reddit.com/t3_1qdf95t",
      "type": "search",
      "subreddit": "gamers",
      "title": "Steam Machine and Frame Standards!",
      "content": "My wish and what I think it willbe the most Genius movement from Valve: So steam machine, steam Frame and steam controller get release in spring and the Half life 3 will be the flagship of the movement beeing able to be played in flatscreen and VR included. Please GabeN make all our dreams come true! I think all the games or at least most of them should get release in the 2 formats as a part of the same product, let's say for example The forest, No mans sky and some more games that. Thanks for this devs not being greedy! What are your thoughts guys? submitted by /u/Arghi0- to r/gamers [link] [comments]",
      "link": "https://www.reddit.com/r/gamers/comments/1qdf95t/steam_machine_and_frame_standards/",
      "author": "/u/Arghi0-",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:46:55.072352"
    },
    {
      "id": "https://www.reddit.com/t3_1qdfcd9",
      "type": "search",
      "subreddit": "totalwar",
      "title": "Total war wahammer 40K and Imperial knights",
      "content": "If they institute imperial knights as a faction/unit, how do you think it would work? For example/going back, do you think it would be a faction or just a unit/lord(?) for another army? Secondly, has there ever been a kind of “hero army” like what would be required for knights? Thirdly and finally, do you think they will ever actually add knights? Note: originally when I thought of making this post I was going to just put “we aren’t getting added, are we? :(“ but I decided to give some actual discussion topics instead. I’m also asking this question with the knowledge that this is nowhere near something on their radar or concern nor should it be, I’m simply dreaming of what could be and how it could look (hopefully). (It also doesn’t help there isn’t much to base these ideas on because we don’t know much about the game or its mechanics to speculate on) submitted by /u/Transbian_Moment to r/totalwar [link] [comments]",
      "link": "https://www.reddit.com/r/totalwar/comments/1qdfcd9/total_war_wahammer_40k_and_imperial_knights/",
      "author": "/u/Transbian_Moment",
      "search_keyword": "how to make a game",
      "relevance_score": 0,
      "added_at": "2026-01-15T09:46:55.072590"
    }
  ],
  "last_updated": "2026-01-15T09:47:31.341740"
}