{
  "queue": [
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdrlux",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "The first trailer of my platformer game Cybro set in a Cyberpunk world",
      "content": "Compared to usual platformer games, especially platformer shooters, almost each level offers a different thing meaning they must be completed doing different stuff. Shoot, hack, ride your drone, drop a goth chick decoy from it to stun enemies and more. What do you think? submitted by /u/sunwake-games [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdrlux/the_first_trailer_of_my_platformer_game_cybro_set/",
      "author": "/u/sunwake-games",
      "search_keyword": "",
      "relevance_score": 1,
      "added_at": "2026-01-15T18:58:54.680417"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdrk9u",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Ironwood - Now Available",
      "content": "submitted by /u/jgesq [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdrk9u/ironwood_now_available/",
      "author": "/u/jgesq",
      "search_keyword": "",
      "relevance_score": 1,
      "added_at": "2026-01-15T18:58:54.680424"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdrv43",
      "type": "post",
      "subreddit": "godot",
      "title": "I made a Mimikyu Endless Runner in about 10 hours using Godot. What do you think? (Android/PC)",
      "content": "Hey everyone! I've been working on this small project. It's a tribute to Mimikyu's first appearance in the abandoned supermarket in Pokémon Sun & Moon. Current Features: Mechanics: Infinite run, dodging boxes, and collecting Will-o'-Wisps. Shiny System: Collecting enough wisps unlocks a Shiny skin (Black & White) with unshaded star particles (thanks for the help with the local coords!). Atmosphere: I worked hard on the lighting and dark ambient sounds to make it feel spooky but cozy. Optimization: It runs smoothly on almost any device. I'm looking for feedback! Should I add jumps and slides? Maybe other Ghost-type skins? Let me know what you'd like to see! submitted by /u/Arayyy26 [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdrv43/i_made_a_mimikyu_endless_runner_in_about_10_hours/",
      "author": "/u/Arayyy26",
      "search_keyword": "",
      "relevance_score": 1,
      "added_at": "2026-01-15T18:58:54.680603"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdrq2q",
      "type": "post",
      "subreddit": "godot",
      "title": "Amazing plugin for 2.5D",
      "content": "I've found an excellent plugin for 2.5D game development. It's called tilemaplayer3D. There's not much documentation available, at least not that I've found, apart from the excellent YouTube tutorials. It's a very efficient way to create 3D environments from a 2D tilemap. I'm using it and I couldn't be happier with its functionality and simplicity. It's available in the Godot asset library, if you'd like to check it out. submitted by /u/Exotic-Back6726 [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdrq2q/amazing_plugin_for_25d/",
      "author": "/u/Exotic-Back6726",
      "search_keyword": "",
      "relevance_score": 1,
      "added_at": "2026-01-15T18:58:54.680617"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qds7ef",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "After ~1 year of development, my autobattler roguelite just launched on Steam!",
      "content": "After a bit more than a year of solo development, I just launched my game, Frontline Command. It’s an autobattler roguelite where you play as a general, recruit units, and adapt your strategy run by run. The goal for my with this game was to create an autobattler I could play solo for short sessions. As a solodev, I tried to keep it under a reasonable scope so it would release one day (and it did!). I focused first on the main loop then expanding with content (like units, upgrades & generals). If you have any questions regarding the development & the release of the game I would be happy to answer them! submitted by /u/vladirien [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qds7ef/after_1_year_of_development_my_autobattler/",
      "author": "/u/vladirien",
      "search_keyword": "",
      "relevance_score": 1,
      "added_at": "2026-01-15T18:58:54.680675"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qds00k",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "My 3D-platformer wishlists after almost 2 months",
      "content": "It looks like I had a good start, with 90 wishlists on the first day but this was almost exclusively from friends, family and ex-colleagues. It has never been this strong later. I have been getting around 5 wishlists a week lately I had a couple of streamers play a closed demo, then a promoter doing an email campaign, hence the 2 spikes. My game is a 3D-platformer with a grappling hook, so I am not expecting any crazy numbers. But is there anything else I could do to get visibility beside contacting streamers and doing the TikTok/Insta grind ? I don't realize if I should be happy or disappointed? submitted by /u/Illustrious_Move_838 [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qds00k/my_3dplatformer_wishlists_after_almost_2_months/",
      "author": "/u/Illustrious_Move_838",
      "search_keyword": "",
      "relevance_score": 1,
      "added_at": "2026-01-15T18:58:54.680692"
    },
    {
      "id": "https://www.reddit.com/t3_1qds966",
      "type": "search",
      "subreddit": "MinecraftServerFinder",
      "title": "[Civilization] [Hardcore] [SMP] | Minecraft - Bloodlines (1.21.10 Java Edition) (No mods & Voice Chat!)",
      "content": "Hey you! Stop scrolling! Stop scrolling! (please!) :D If you've ever seen one of these Minecraft civilization experiments on YouTube and wished there would be a server that's almost just like that, but open all the time instead of being an event, that's your chance! Here is a bit about us: MCB is a brand new, invite-only hardcore SMP server made to encourage group playing and civilization development. Only already invited players can invite new players to the server. This simulates real life population growth and keeps the community active and free from trolls. On top of this, a series of secret tweaks and mechanics have been implemented to keep the game fresh and interesting. No guides are provided, players need to discover everything on their own, which rewards attentiveness and dedication. An innate clan and family system ensures that you never just spawn alone on a hardcore world. You are not alone, you have been invited. You are part of a clan, of a family, and part of a story that will both precede and succeed you. Here are the original codes provided in this post to join the server instantly! To use them, connect on mcbloodlines.net and enter /originalcode <code> ! - rwvgAOENI - sUhvrgrkD - knBNoKZBW For more information, visit our Website or join the Discord: Website : https://mcbloodlines.net Discord : https://discord.gg/rswMMfFqPw If none of the cods work and you are interested in joining the community, you can join our discord and reach out to current members to see if anybody would be willing to share their personal invitation codes with you! Most clans are recruiting members at this time it seems, so it might be your chance! Please read the wiki page on joining the server to learn how to use invitation codes! submitted by /u/throwaway-ghost000 to r/MinecraftServerFinder [link] [comments]",
      "link": "https://www.reddit.com/r/MinecraftServerFinder/comments/1qds966/civilization_hardcore_smp_minecraft_bloodlines/",
      "author": "/u/throwaway-ghost000",
      "search_keyword": "no code game",
      "relevance_score": 1,
      "added_at": "2026-01-15T18:58:54.680761"
    },
    {
      "id": "https://www.reddit.com/t3_1qdsbos",
      "type": "search",
      "subreddit": "Lenovo",
      "title": "Microphone not detected",
      "content": "So I just got a new Lenovo slim 7. I got it 2 days ago. I'm not sure if this was going on the whole time but I found out today that the microphone doesn't work. I went into settings and saw that \"microphone array AMD sound device\" was the sound input. I clicked it, tried to do a sound test but got no sound. Then after going back it dissappeared completely as sound input. The things I've tried: Trouble shoot in windows and Lenovo Vantage. Uninstalled the drivers in device manager. Like all of them, not just the microphone array. Also the drivers in the \"sound video and game controllers\" section. They all reinstalled after rebooting but the issue was the same: It recognizes it until it tries to use it and then it dissapears. I've done a reset of the laptop, but I think I might have made a backup after those updates were installed. I don't remember where I did it. But I remember clicking an option that said make a back up for when you have to reset or something similar. The reset didn't do much. I also downloaded the driver from the Lenovo website for my model but it doesn't make a difference. Any ideas? I spent like 6 hours trying to figure this out today. My specs: Device Name: LENOVO Product number: 83JY0035MH Serial number: MP2RP1G8 Bios version: QTCN25WW Processor: AMD Ryzen AI 7 350 w/ Radeon 860M Storage: 951.6 GB Installed RAM: 32 GB (31.3 GB usable) submitted by /u/DutchDreams7 to r/Lenovo [link] [comments]",
      "link": "https://www.reddit.com/r/Lenovo/comments/1qdsbos/microphone_not_detected/",
      "author": "/u/DutchDreams7",
      "search_keyword": "make game without coding",
      "relevance_score": 1,
      "added_at": "2026-01-15T18:58:54.681270"
    },
    {
      "id": "https://www.reddit.com/t3_1qdsaa5",
      "type": "search",
      "subreddit": "techsupport",
      "title": "Lenovo microphone not detected (AMD Ryzen AI 7 350)",
      "content": "So I just got a new Lenovo slim 7. I got it 2 days ago. I'm not sure if this was going on the whole time but I found out today that the microphone doesn't work. I went into settings and saw that \"microphone array AMD sound device\" was the sound input. I clicked it, tried to do a sound test but got no sound. Then after going back it dissappeared completely as sound input. The things I've tried: Trouble shoot in windows and Lenovo Vantage. Uninstalled the drivers in device manager. Like all of them, not just the microphone array. Also the drivers in the \"sound video and game controllers\" section. They all reinstalled after rebooting but the issue was the same: It recognizes it until it tries to use it and then it dissapears. I've done a reset of the laptop, but I think I might have made a backup after those updates were installed. I don't remember where I did it. But I remember clicking an option that said make a back up for when you have to reset or something similar. The reset didn't do much. I also downloaded the driver from the Lenovo website for my model but it doesn't make a difference. Any ideas? I spent like 6 hours trying to figure this out today. My specs: Device Name: LENOVO Product number: 83JY0035MH Serial number: MP2RP1G8 Bios version: QTCN25WW Processor: AMD Ryzen AI 7 350 w/ Radeon 860M Storage: 951.6 GB Installed RAM: 32 GB (31.3 GB usable) submitted by /u/DutchDreams7 to r/techsupport [link] [comments]",
      "link": "https://www.reddit.com/r/techsupport/comments/1qdsaa5/lenovo_microphone_not_detected_amd_ryzen_ai_7_350/",
      "author": "/u/DutchDreams7",
      "search_keyword": "AI game maker",
      "relevance_score": 1,
      "added_at": "2026-01-15T18:58:54.681446"
    },
    {
      "id": "https://www.reddit.com/t3_1qds8ih",
      "type": "search",
      "subreddit": "bilgisayar",
      "title": "ALINIR MI?? MSI VECTOR 16 HX AI 5070Ti",
      "content": "Merhaba arkadaşlar yarın bu bilgisayarı satın alacağım önerir misiniz sprun yaşar mıyım? MSI VECTOR 16 HX AI A2XWHG-091XTR Intel Core Ultra 7-255HX 16GB DDR5 1TB SSD GeForce RTX 5070 Ti 12GB 140W 16 inç FHD+ 144Hz FreeDos Gaming Laptop submitted by /u/anonim198710 to r/bilgisayar [link] [comments]",
      "link": "https://www.reddit.com/r/bilgisayar/comments/1qds8ih/alinir_mi_msi_vector_16_hx_ai_5070ti/",
      "author": "/u/anonim198710",
      "search_keyword": "AI game maker",
      "relevance_score": 1,
      "added_at": "2026-01-15T18:58:54.681459"
    },
    {
      "id": "https://www.reddit.com/t3_1qds4p8",
      "type": "search",
      "subreddit": "u_Odd_Life4",
      "title": "Is it awkward to warn a new online friend about a scam?",
      "content": "Hi everyone. Looking for some perspective on a slightly awkward social situation. I recently encountered a pretty obvious Discord scam where someone pretended to be from a game company. After handling it, I sent a warning to a friend I made through gaming, saying something like, \"Hey, heads up, there are scammers pretending to be game devs offering gifts, be careful.\" His only reply was: Ok bro\" (with several k's).We're relatively new friends, and now I'm stuck in my head about it. Part of me thinks it's just a casual, non-verbal way of saying \"noted.\" Another part worries it came off as random, overly cautious, or even patronizing to give unsolicited advice. I tend to overthink social cues. Has anyone been on either side of this? Was it weird of me to send that warning out of the blue to a new friend? What's your read on a reply like that? submitted by /u/Odd_Life4 to u/Odd_Life4 [link] [comments]",
      "link": "https://www.reddit.com/r/u_Odd_Life4/comments/1qds4p8/is_it_awkward_to_warn_a_new_online_friend_about_a/",
      "author": "/u/Odd_Life4",
      "search_keyword": "game dev beginner",
      "relevance_score": 1,
      "added_at": "2026-01-15T18:58:54.681629"
    },
    {
      "id": "https://www.reddit.com/t3_1qds2kl",
      "type": "search",
      "subreddit": "gamedev",
      "title": "I got recognised in the street by a fan of my game and I think now my life has peaked",
      "content": "I'm the dev of a moderately successful indie game that has been played by probably no more than half a million people. It's a wonderful number but not the insane levels of reach some devs get and certainly not enough to be recognised anywhere (I thought). Walked past a traffic crossing with my girlfriend and someone stopped me and knew my name, said they were a fan of the game and that they'd seen me on a podcast which may have been how they recognised my face. The dude was super nice and it was a wholesome encounter but I literally walked away speechless. Is this peak? Literally had so many magical moments in gamedev but this was special. submitted by /u/Huw2k8 to r/gamedev [link] [comments]",
      "link": "https://www.reddit.com/r/gamedev/comments/1qds2kl/i_got_recognised_in_the_street_by_a_fan_of_my/",
      "author": "/u/Huw2k8",
      "search_keyword": "game dev beginner",
      "relevance_score": 1,
      "added_at": "2026-01-15T18:58:54.681649"
    },
    {
      "id": "https://www.reddit.com/t3_1qds9by",
      "type": "search",
      "subreddit": "pokerlistings",
      "title": "Chad Eveslage Binks $500,000 For Winning the PGT Championship Freeroll",
      "content": "https://preview.redd.it/kbo2ax438kdg1.jpg?width=1400&format=pjpg&auto=webp&s=878a268d97ff442ce74df8ff279fe59b2b3d64e5 Not all freerolls are created equal, as evidenced by Chad Eveslage taking down the 2025 PokerGo Tour (PGT) $1,000,000 Championship Freeroll on Tuesday evening. He sealed the deal, besting a field of seven players who returned for the second and final day. The dual WPT winner and quadruple WSOP Bracelet holder topped a total field of 54 entrants. The field was comprised of some of the game’s brightest and best, such as Alex Foxen , Andrew “LuckyChewy” Lichtenberger, and Daniel “KidPoker” Negreanu . Here is a look at how the action transpired. How It Started The freeroll event field included the top 40 players on the PGT leaderboard and 14 Dream Seat qualifiers. After 47 eliminations took place on Day 1, a group of seven returned for the final day of action. Alex Foxen, who came into the freeroll with the biggest stack, departed in 13th, and he couldn’t notch his second title of the year, having already won the $10K PGT Last Chance for $232,400 just a few days prior. In what was possibly the toughest field ever assembled in a freeroll, Ben Tollerene (53rd), Nick Petrangelo (51st), Ike Haxton (47th), Patrick Leonard (46th), Jesse Lonis (38th), Jason Koon (35th), and Michael Mizrachi (29th) are just a few of the notable names that fell short in this star studed line up. At the top of the UK’s All-Time Money List, Stephen Chidwick was the last elimination of the night before play broke for Day 2. Day 2 – Final Table Play Michael Wang came into Day 2 with the chip lead, and the $500,000 first-place prize would’ve been the American professional’s fourth-largest cash. Between them, the final seven have won 25 PGT titles, with Negreanu winning 11 of them, which currently stands as the record for the most PGT wins. Eric Blair, who has accumulated just over $4,000,000 in live tournament earnings according to thehendonmob.com , was the shortest stack returning, and all seven players were on the money bubble. Eventually, Blair lost a flip to Aaron Krupin to bust in seventh place and send the final six players into the money. Blair had A Q and Kupin had 9 9 . A win in this tournament would have resulted in a new career best for Blair, but unfortunately for him, the Poker Gods denied the American that opportunity. His two biggest scores have both come at the PGT in Las Vegas, having won the $15,100 No Limit Hold’em and the $10,100 No Limit Hold’em just days apart last February for $352,350 and $254,800. John Riordan was next to depart and was on the wrong side of a cooler at the hands of Eveslage. Both players flopped trip fives, but Riordan’s five kicker was no good against the king kicker of Eveslage. Riordan added $40,000 to his total earnings of $6,505,124. Lichtenberger then went on to claim his first scalp, as he sent Kupin to the rail with ten-nine suited. “LuckyChewy” made two pair to beat Kupin’s ace-eight off suit. Kupin called a jam from Lichtenberger, who put Kupin at risk in a small v big blind confrontation. Then There Were Three Wang had climbed up the counts by this stage in the tournament, and he had a slight lead over Eveslage. Wang made a straight with ace-four offsuit versus Lichtenberger, who rivered top two pair with ace-seven offsuit on a paired board. Unfortunately for him, it was the Gin card for Wang, and he claimed a sizeable pot against a formidable opponent to put himself back in contention for the title. Lichtenberger and Negreanu occupied the bottom two spots of the chip counts, and it was the latter who was next to depart, as he ran into the jacks of Eveslage. Negreanu called a three-bet preflop in the cutoff versus the small blind, and he found himself putting the last of his chips in on the flop of 5 3 4 with A 6 . The Hall of Famer had plenty of outs, but couldn’t hit an ace or make a straight on the 10 3 turn and river. “LuckyChewy” then brought himself back into contention as he doubled with ace-queen offsuit versus the king-ten offsuit of Wang. Lichtenberger binked an ace on the turn to secure the double up, but was still bottom of the pack. He then gave some to Eveslage, as he made an incorrect hero-call with queen-high to lose to two pair of jacks and sixes, with the board being paired. Lichtenberger then doubled again, this time through Eveslage, as his ace-eight suited cracked Eveslage’s jacks as “LuckyChewy” flopped an ace and turned two pair to leave Eveslage drawing slim but still atop the counts. Eventually, it was Wang who would miss out on the heads-up duel with either Lichtenberger or Eveslage. Eveslage had kings in a three-bet pot, Wang had ten-nine suited, and flopped two pair on 9 10 8 . The 2 changed nothing but the 8 counterfeit Wang’s two pair to give Eveslage kings and eights to take the tournament into heads-up play. Heads-Up The heads-up battle was brief and resulted in a preflop all-in. Despite Lichtenberger’s solid efforts throughout the two-day event, he fell short of the $500,000 top prize, but banked $200,000 for his second-place finish. Lichtenberger was all in and well covered, and his 6 8 was drawing dead on the turn of the 2 Q 4 J 3 as Eveslage turned a set with J J to confirm the victory and a bumper payday in an extremely competitive field. Eveslage said to the media after his victory: “It feels great. I don’t feel super confident in my No-Limit game, and battling against all these guys (and winning), it feels great. Ten out of ten. It feels awesome.” This poker writer assumes this victory will fill the Mixed Game Specialist with a considerable amount of confidence heading into future High Stakes No Limit Hold’em tournaments in the future. Below are the payouts. PGT Championship Payouts Place Player Prize 1 Chad Eveslage $500,000 2 Andrew Lichtenberger $200,000 3 Michael Wang $120,000 4 Daniel Negreanu $80,000 5 Aaron Kupin $60,000 6 John Riordan $40,000 What’s Next? Stay tuned to pokerlistings.com to keep up to date with all the news from across the poker world. That’s all for now, folks. Until next time. Source : https://www.pokerlistings.com/news/chad-eveslage-binks-500000-for-winning-the-pgt-championship-freeroll by Patrick Cole submitted by /u/gospodinDark to r/pokerlistings [link] [comments]",
      "link": "https://www.reddit.com/r/pokerlistings/comments/1qds9by/chad_eveslage_binks_500000_for_winning_the_pgt/",
      "author": "/u/gospodinDark",
      "search_keyword": "how to make a game",
      "relevance_score": 1,
      "added_at": "2026-01-15T18:58:54.681954"
    },
    {
      "id": "https://www.reddit.com/t3_1qdkhw4",
      "type": "search",
      "subreddit": "psagrading",
      "title": "Is Collectors club membership worth it?",
      "content": "I plan on doing a grading submission and was exploring my options. Last time I did, I used GameStop which was fine. I kind of wanted to do direct through PSA this time just so I could better track the progress of my order. Without the membership it’s $27.99 a card. The membership at $200 for the year (might as well get CardLadder pro as well since I want to anyways) gets you $18.99 per card bulk submissions (minimum 20 cards per). I’m not sure how often I plan on sending in cards this year. I’m just trying to figure out the best value option. I’m not a dealer or anything I am just in the hobby for fun and if I make money, great. What does everyone think is the best grading option? submitted by /u/ORDinary_card_guy to r/psagrading [link] [comments]",
      "link": "https://www.reddit.com/r/psagrading/comments/1qdkhw4/is_collectors_club_membership_worth_it/",
      "author": "/u/ORDinary_card_guy",
      "search_keyword": "how to make a game",
      "relevance_score": 0,
      "added_at": "2026-01-15T14:14:26.538852"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdldvq",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "I made a game that reacts to everything you do",
      "content": "submitted by /u/Arfhis [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdldvq/i_made_a_game_that_reacts_to_everything_you_do/",
      "author": "/u/Arfhis",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T14:46:38.502998"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdkzsc",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Ah, finally a suitable sovereign for the job....",
      "content": "Fun looking 'Round Table Management RPG' from indie devs WILD WITS - Coming to Steam August 2026 Look like a laugh if the steam page is anything to go by. submitted by /u/Sir_Cluckles [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdkzsc/ah_finally_a_suitable_sovereign_for_the_job/",
      "author": "/u/Sir_Cluckles",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T14:46:38.503069"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdl00m",
      "type": "post",
      "subreddit": "godot",
      "title": "Question about Vector3.signed_angle_to()",
      "content": "The docs say that this method should return a signed angle between two vectors, using an arbitrary axis on which they are projected. In my project, I have vectors a and b , and a tangential vector used for the axis. I expected that the closer are a and b to being opposites, the closer their angle would be to π. Instead, as a and b get closer to being opposites, the returned angle is closer to 0. The more a and b point towards the same direction, the closer the returned angle is to π. Why exactly is that? I have made sure the axis is tangential, and I am excluding cases where the vectors are exactly opposites. submitted by /u/Alezzandrooo [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdl00m/question_about_vector3signed_angle_to/",
      "author": "/u/Alezzandrooo",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T14:46:38.503190"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdkw79",
      "type": "post",
      "subreddit": "godot",
      "title": "Do you think this intro is sufficient?",
      "content": "submitted by /u/BoneMarrowGames [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdkw79/do_you_think_this_intro_is_sufficient/",
      "author": "/u/BoneMarrowGames",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T14:46:38.503221"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qdkxk8",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "Cascade to Niagara Converter - Free Inbuilt Plugin - Unreal Engine 5.6",
      "content": "Youtube Tutorial Cascade to Niagara Converter - Free Inbuilt Plugin - Unreal Engine 5.6 💡What you will learn 📌Convert Cascade VFX effects to Niagara 📌Fix issues during conversion 📌Using the Niagara Effects in Blueprints submitted by /u/braveior [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qdkxk8/cascade_to_niagara_converter_free_inbuilt_plugin/",
      "author": "/u/braveior",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T14:46:38.503236"
    },
    {
      "id": "https://www.reddit.com/r/unrealengine/t3_1qdkqme",
      "type": "post",
      "subreddit": "unrealengine",
      "title": "What are the smiley and sad faces on UGS?",
      "content": "hi all, despite being in games for over an while, i still dont know wtf these are forr? The smiley and sad faces in the change lists. Im clicking them but nothings happening? submitted by /u/Inevitable_Grape382 [link] [comments]",
      "link": "https://www.reddit.com/r/unrealengine/comments/1qdkqme/what_are_the_smiley_and_sad_faces_on_ugs/",
      "author": "/u/Inevitable_Grape382",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T14:46:38.503244"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdkyff",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "Cascade to Niagara Converter - Free Inbuilt Plugin - Unreal Engine 5.6",
      "content": "Youtube Tutorial Cascade to Niagara Converter - Free Inbuilt Plugin - Unreal Engine 5.6 💡What you will learn 📌Convert Cascade VFX effects to Niagara 📌Fix issues during conversion 📌Using the Niagara Effects in Blueprints submitted by /u/braveior [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdkyff/cascade_to_niagara_converter_free_inbuilt_plugin/",
      "author": "/u/braveior",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T14:46:38.503254"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdkmy3",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "Added the first infantry unit to my RTS Final Divide",
      "content": "submitted by /u/finaldivide_rts [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdkmy3/added_the_first_infantry_unit_to_my_rts_final/",
      "author": "/u/finaldivide_rts",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T14:46:38.503260"
    },
    {
      "id": "https://www.reddit.com/t3_1qdkug5",
      "type": "search",
      "subreddit": "xbox360",
      "title": "Bought a used copy of halo 3 and found this, never been used",
      "content": "submitted by /u/SeriousWonder1105 to r/xbox360 [link] [comments]",
      "link": "https://www.reddit.com/r/xbox360/comments/1qdkug5/bought_a_used_copy_of_halo_3_and_found_this_never/",
      "author": "/u/SeriousWonder1105",
      "search_keyword": "no code game",
      "relevance_score": 0,
      "added_at": "2026-01-15T14:46:38.503616"
    },
    {
      "id": "https://www.reddit.com/t3_1qdkl0y",
      "type": "search",
      "subreddit": "reddeadmysteries",
      "title": "Let's talk about feather shooting",
      "content": "Long time lurker, and a happy follower of the Spiderdream mystery here. Today, I came across u/Dizstance 's post and a snippet from that got me thinking. They pointed out: The game most likely stores which feather you've shot/\"taken\" down, regardless of how they respawn, and this game memory most likely reset once you've hit all of them. It then checks if you did it in the correct order, if not, no trigger. And this is precisely what I was wondering for the longest time. Shouldn't such game logic be relatively easy to find in the code? Why did none of the crazy Reddit RDR2 detectives find anything similar yet? Even before that, can we somehow infer from the code whether the spider webs or the feathers are triggers that change the game state in any way? submitted by /u/alasthennars to r/reddeadmysteries [link] [comments]",
      "link": "https://www.reddit.com/r/reddeadmysteries/comments/1qdkl0y/lets_talk_about_feather_shooting/",
      "author": "/u/alasthennars",
      "search_keyword": "no code game",
      "relevance_score": 0,
      "added_at": "2026-01-15T14:46:38.503702"
    },
    {
      "id": "https://www.reddit.com/t3_1qdle8n",
      "type": "search",
      "subreddit": "badredman",
      "title": "Dear Invaders, pls don't ragecheat when you die to hosts",
      "content": "First things first, I want to tell you, that I respect invaders by default (at least the concept). I used to invade myself, I know perfectly well how fun it is, yada yada yada... But when you invade mere PvE's (like myself) with your 1/2-shot minmaxed PvP build, throw ( what is an equivalent of) Dung Pies at us for ... I have no fckng idea what reason (probably because there were 2 of us, cause this is how Elden Ring SC invasions work) and then still die to us, pls don't embarass yourself by toggling the cheats on - we don't owe you an easy win. I know, I know, invaders (at least in Elden Ring) are at a massive disadvantage: numbers, no friendly fire, e.t.c. . But pls understand, it's not our fault you decided to invade us, it's not our fault you decided to literally teleport on our heads, it's not our fault we're going through PvE and don't want to be an easy prey for your YT montage to feed your ego. We're just going through the game, having our fun. If that makes you mad - stop doom gaming, get some help, touch some snow. submitted by /u/Competitive_Ad2539 to r/badredman [link] [comments]",
      "link": "https://www.reddit.com/r/badredman/comments/1qdle8n/dear_invaders_pls_dont_ragecheat_when_you_die_to/",
      "author": "/u/Competitive_Ad2539",
      "search_keyword": "make game without coding",
      "relevance_score": 0,
      "added_at": "2026-01-15T14:46:38.504266"
    },
    {
      "id": "https://www.reddit.com/t3_1qdldi4",
      "type": "search",
      "subreddit": "Fighters",
      "title": "What are your favorite character combos that are both stylish and effective in your go-to fighting games?",
      "content": "As a fighting game enthusiast, I love finding combos that not only deal damage but also look amazing when executed. Whether it's a flashy juggle in Street Fighter, a devastating string in Tekken, or a creative setup in Guilty Gear, there's something satisfying about pulling off a combo that makes your opponent go \"Wow!\" I'm curious to hear what combos you all enjoy using. Do you have specific characters that you feel have the best or most stylish combos? What strategies do you use to set them up, and how do they fit into your overall gameplay? submitted by /u/1acina to r/Fighters [link] [comments]",
      "link": "https://www.reddit.com/r/Fighters/comments/1qdldi4/what_are_your_favorite_character_combos_that_are/",
      "author": "/u/1acina",
      "search_keyword": "how to make a game",
      "relevance_score": 0,
      "added_at": "2026-01-15T14:46:38.504920"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdm2ou",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "ux is hard",
      "content": "Last year I designed this piece to produce a mock-up of a home screen, but I couldn't think of a good solution for the menu information (layout, size, styling, etc.). submitted by /u/the_terrible_nukpen [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdm2ou/ux_is_hard/",
      "author": "/u/the_terrible_nukpen",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:13:47.194028"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdm25s",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "A (very early) WIP for \"The Clown\" boss fight in our game! What do you think?",
      "content": "submitted by /u/Red_Dunes_Games [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdm25s/a_very_early_wip_for_the_clown_boss_fight_in_our/",
      "author": "/u/Red_Dunes_Games",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:13:47.194039"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdlzwh",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Some mage spells animation we made four our game Pathbreakers!",
      "content": "submitted by /u/6-EyesStudio [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdlzwh/some_mage_spells_animation_we_made_four_our_game/",
      "author": "/u/6-EyesStudio",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:13:47.194046"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdlzb3",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "We added a Ragdoll Mechanic by an accident!",
      "content": "We figured it out when we tested the game before we start the Playtest, and I think it added a really good touch to the game... what do you think? Keep it? or remove it? our playtest is open now, if you want to participate just tell me in the comments and I'll send you the links to our Discord Server where we running the playtest, and the playtest link.. the game is basically a Co-op platformer game called FLING FRIENDS where you and your friends are tide together and you've to climb to the top of the world using the rube by flinging each other and passes the color-based environments so you can't climb alone... submitted by /u/Worried_Firefighter1 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdlzb3/we_added_a_ragdoll_mechanic_by_an_accident/",
      "author": "/u/Worried_Firefighter1",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:13:47.194082"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdlhg3",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "Ah, finally a suitable sovereign for the job....",
      "content": "submitted by /u/Sir_Cluckles [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdlhg3/ah_finally_a_suitable_sovereign_for_the_job/",
      "author": "/u/Sir_Cluckles",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:13:47.194140"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdlh3p",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "I made a game that reacts to everything you do",
      "content": "submitted by /u/Arfhis [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdlh3p/i_made_a_game_that_reacts_to_everything_you_do/",
      "author": "/u/Arfhis",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:13:47.194147"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qdllwf",
      "type": "post",
      "subreddit": "unity",
      "title": "Is unity down?",
      "content": "Idk what’s happening but this is how my screen is right now it installed 6.1 and 6.3 both are having same issues in all file submitted by /u/rkoshot [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qdllwf/is_unity_down/",
      "author": "/u/rkoshot",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:13:47.194234"
    },
    {
      "id": "https://www.reddit.com/t3_1qdm35e",
      "type": "search",
      "subreddit": "ufl",
      "title": "Why does UF have basically the same exact questions as the additional information page on Commonapp. They’re going to see them anyway? How do I answer them without making it seem like I’m repeating myself?",
      "content": "submitted by /u/Present-Bench483 to r/ufl [link] [comments]",
      "link": "https://www.reddit.com/r/ufl/comments/1qdm35e/why_does_uf_have_basically_the_same_exact/",
      "author": "/u/Present-Bench483",
      "search_keyword": "make game without coding",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:13:47.195106"
    },
    {
      "id": "https://www.reddit.com/t3_1qdls78",
      "type": "search",
      "subreddit": "stickers",
      "title": "My sticker fridge!",
      "content": "It will sadly soon be retired but it had a good life! submitted by /u/Trollkattene to r/stickers [link] [comments]",
      "link": "https://www.reddit.com/r/stickers/comments/1qdls78/my_sticker_fridge/",
      "author": "/u/Trollkattene",
      "search_keyword": "AI game maker",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:13:47.195304"
    },
    {
      "id": "https://www.reddit.com/t3_1qdlrw3",
      "type": "search",
      "subreddit": "CallOfWar",
      "title": "How?",
      "content": "Isnt twin fronts down now? submitted by /u/BrightstrikeYT to r/CallOfWar [link] [comments]",
      "link": "https://www.reddit.com/r/CallOfWar/comments/1qdlrw3/how/",
      "author": "/u/BrightstrikeYT",
      "search_keyword": "AI game maker",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:13:47.195309"
    },
    {
      "id": "https://www.reddit.com/t3_1qdm168",
      "type": "search",
      "subreddit": "Pikmin",
      "title": "Playing Pikmin 1 for the first time..",
      "content": "Hi all, first post so sorry if posting incorrectly. I usually make these for my hack and slash games, but we're broadening our horizons. Ive rigorously played through Pikmin 3 + 4 and now finally am able to play 1+2 (GC) I had fun making making this lil video on my experience so far. I will say the rudest awakening was having to mash A instead of holding...if only i knew how good I had it 🌚 submitted by /u/BARRELETTO to r/Pikmin [link] [comments]",
      "link": "https://www.reddit.com/r/Pikmin/comments/1qdm168/playing_pikmin_1_for_the_first_time/",
      "author": "/u/BARRELETTO",
      "search_keyword": "how to make a game",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:13:47.195802"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdma8y",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "The first thing came to my mind we i saw this game was Nine Sols",
      "content": "How far am i submitted by /u/Remarkable-Pizza4263 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdma8y/the_first_thing_came_to_my_mind_we_i_saw_this/",
      "author": "/u/Remarkable-Pizza4263",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:50:12.321338"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdm742",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "green boy",
      "content": "green boy https://geelstation2023.itch.io/greenboy submitted by /u/Any-Solution-7879 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdm742/green_boy/",
      "author": "/u/Any-Solution-7879",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:50:12.321344"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdmrxj",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "Batter turned into a dancer",
      "content": "Accidentally made my Batter dance while batting lol submitted by /u/Boboter [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdmrxj/batter_turned_into_a_dancer/",
      "author": "/u/Boboter",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:50:12.321355"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdmb2f",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "I've just achieved 5.000 wishlist in 6 month. Thank you all!",
      "content": "submitted by /u/Remarkable-Recipe710 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdmb2f/ive_just_achieved_5000_wishlist_in_6_month_thank/",
      "author": "/u/Remarkable-Recipe710",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:50:12.321378"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdmvvd",
      "type": "post",
      "subreddit": "godot",
      "title": "My release date is encroaching (feb 16) and I have but 2200 meager wishlists am I cooked",
      "content": "https://store.steampowered.com/app/3372460/Screaming_Head/ submitted by /u/ax3lax3l [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdmvvd/my_release_date_is_encroaching_feb_16_and_i_have/",
      "author": "/u/ax3lax3l",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:50:12.321412"
    },
    {
      "id": "https://www.reddit.com/t3_1qdmlup",
      "type": "search",
      "subreddit": "opensourcegames",
      "title": "BEEP-8: An open-source fantasy console with MIT-licensed SDK — write games in C/C++ and run them in the browser",
      "content": "Recently came across BEEP-8, an open-source fantasy console project that I thought this community might appreciate. It emulates a fictional 4 MHz ARM handheld entirely in the browser. You write games in C/C++, compile them to small ROMs, and they run at 60fps on desktop or mobile — no install required. What makes it relevant here: The SDK is fully open source under MIT license Several sample games included with source code All runs client-side in JavaScript 🎮 Play: https://beep8.org 💻 GitHub: https://github.com/beep8/beep8-sdk If you're into fantasy consoles or low-level game development, it's a neat project to explore. submitted by /u/Positive_Board_8086 to r/opensourcegames [link] [comments]",
      "link": "https://www.reddit.com/r/opensourcegames/comments/1qdmlup/beep8_an_opensource_fantasy_console_with/",
      "author": "/u/Positive_Board_8086",
      "search_keyword": "no code game",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:50:12.322449"
    },
    {
      "id": "https://www.reddit.com/t3_1qdn229",
      "type": "search",
      "subreddit": "Engadget",
      "title": "Samsung’s refreshed Mobile Gaming Hub is trying to make it easier to discover new games",
      "content": "submitted by /u/Bot-alex to r/Engadget [link] [comments]",
      "link": "https://www.reddit.com/r/Engadget/comments/1qdn229/samsungs_refreshed_mobile_gaming_hub_is_trying_to/",
      "author": "/u/Bot-alex",
      "search_keyword": "make game without coding",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:50:12.322625"
    },
    {
      "id": "https://www.reddit.com/t3_1qdmwnb",
      "type": "search",
      "subreddit": "LaptopDealsIndia",
      "title": "Is this a good deal at 92k on Flipkart (read body pls)",
      "content": "I have a good amount of gc balance which i have collected over a period of time from various lucky draws and games. So this price is after cc discount and gc bal for me submitted by /u/_corporate_majdoor_ to r/LaptopDealsIndia [link] [comments]",
      "link": "https://www.reddit.com/r/LaptopDealsIndia/comments/1qdmwnb/is_this_a_good_deal_at_92k_on_flipkart_read_body/",
      "author": "/u/_corporate_majdoor_",
      "search_keyword": "AI game maker",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:50:12.323142"
    },
    {
      "id": "https://www.reddit.com/t3_1qdn20q",
      "type": "search",
      "subreddit": "gameDevClassifieds",
      "title": "[FOR HIRE] Creature and Environment concept Artist",
      "content": "With 5 years of Game Dev industry experience, I can help you visualize Monsters, props and plants for your game - or your next DND project. submitted by /u/Prudent-Position9102 to r/gameDevClassifieds [link] [comments]",
      "link": "https://www.reddit.com/r/gameDevClassifieds/comments/1qdn20q/for_hire_creature_and_environment_concept_artist/",
      "author": "/u/Prudent-Position9102",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:50:12.323151"
    },
    {
      "id": "https://www.reddit.com/t3_1qdmys1",
      "type": "search",
      "subreddit": "ForefrontVR",
      "title": "NEW UPDATE DROPPED! NEW MAP AND SNIPER UPDATES!",
      "content": "submitted by /u/Mehdals_ to r/ForefrontVR [link] [comments]",
      "link": "https://www.reddit.com/r/ForefrontVR/comments/1qdmys1/new_update_dropped_new_map_and_sniper_updates/",
      "author": "/u/Mehdals_",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T15:50:12.323200"
    },
    {
      "id": "https://www.reddit.com/r/gamedev/t3_1qdnu1b",
      "type": "post",
      "subreddit": "gamedev",
      "title": "Has anyone here ever used Devpods?",
      "content": "I've been a solo dev for a few years now working intermittently on projects while in school. Now I'm looking to work with groups so I can get more projects under my belt as well as more experience collaborating with others. I recently have gotten a lot of ads about Devpods and wanted to see if anyone on this sub reddit had used it for collaborating on games before I signed up. submitted by /u/ClebThePlebYT [link] [comments]",
      "link": "https://www.reddit.com/r/gamedev/comments/1qdnu1b/has_anyone_here_ever_used_devpods/",
      "author": "/u/ClebThePlebYT",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:20:09.558711"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdnmgl",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "What's behind the poster",
      "content": "submitted by /u/liquidpixeldev [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdnmgl/whats_behind_the_poster/",
      "author": "/u/liquidpixeldev",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:20:09.558770"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdndym",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "We created a new enemy for our game, that makes the whole UI go wild",
      "content": "submitted by /u/Llamaware [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdndym/we_created_a_new_enemy_for_our_game_that_makes/",
      "author": "/u/Llamaware",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:20:09.558827"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdnacl",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Design feedback needed: a 3D puzzle game based on cube manipulation",
      "content": "submitted by /u/Season_Famous [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdnacl/design_feedback_needed_a_3d_puzzle_game_based_on/",
      "author": "/u/Season_Famous",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:20:09.558837"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdndvw",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "We created a new enemy for our game, that makes the whole UI go wild",
      "content": "submitted by /u/Llamaware [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdndvw/we_created_a_new_enemy_for_our_game_that_makes/",
      "author": "/u/Llamaware",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:20:09.558907"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdnkcq",
      "type": "post",
      "subreddit": "godot",
      "title": "Free assets for godot engine glb cc0",
      "content": "I made an update for my cozy farm asset with plenty of new usefull objects, more than 40 new objects it's free and cc0 so you can do whatever you want with them if you are interested you can click this link https://styloo.itch.io/farm submitted by /u/LoquatPutrid2894 [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdnkcq/free_assets_for_godot_engine_glb_cc0/",
      "author": "/u/LoquatPutrid2894",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:20:09.558945"
    },
    {
      "id": "https://www.reddit.com/t3_1qdnwni",
      "type": "search",
      "subreddit": "Rapids",
      "title": "No Pre$@le Code for the 30th Anniversary Game",
      "content": "We acquired seats for the RSL game and was told that we'd get a pre$@le code for the 30th with that. Nothing ever showed up. Did anyone else go through this? sorry about the weird grammar and spelling. stupid auto mod wouldn't let me post regular English. submitted by /u/artisinal_lethargy to r/Rapids [link] [comments]",
      "link": "https://www.reddit.com/r/Rapids/comments/1qdnwni/no_prele_code_for_the_30th_anniversary_game/",
      "author": "/u/artisinal_lethargy",
      "search_keyword": "no code game",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:20:09.559036"
    },
    {
      "id": "https://www.reddit.com/t3_1qdnva5",
      "type": "search",
      "subreddit": "Rapids",
      "title": "No Presale Code for the 30th Anniversary Game",
      "content": "We bought tickets for the RSL game and was told that we'd get a presale code for the 30th with that. Nothing ever showed up. Did anyone else go through this? submitted by /u/artisinal_lethargy to r/Rapids [link] [comments]",
      "link": "https://www.reddit.com/r/Rapids/comments/1qdnva5/no_presale_code_for_the_30th_anniversary_game/",
      "author": "/u/artisinal_lethargy",
      "search_keyword": "no code game",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:20:09.559044"
    },
    {
      "id": "https://www.reddit.com/t3_1qdnu1b",
      "type": "search",
      "subreddit": "gamedev",
      "title": "Has anyone here ever used Devpods?",
      "content": "I've been a solo dev for a few years now working intermittently on projects while in school. Now I'm looking to work with groups so I can get more projects under my belt as well as more experience collaborating with others. I recently have gotten a lot of ads about Devpods and wanted to see if anyone on this sub reddit had used it for collaborating on games before I signed up. submitted by /u/ClebThePlebYT to r/gamedev [link] [comments]",
      "link": "https://www.reddit.com/r/gamedev/comments/1qdnu1b/has_anyone_here_ever_used_devpods/",
      "author": "/u/ClebThePlebYT",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:20:09.560591"
    },
    {
      "id": "https://www.reddit.com/t3_1qdnnyc",
      "type": "search",
      "subreddit": "diablo4",
      "title": "Affix Replaced just bricked my character. No reason to even play it. Sad and bummed.",
      "content": "I had a 4 ga crossbow (dex, max life, damage, crit damage) on my death trap rogue. Hard enough playing something non-paladin (I have 4 paladins, love em), but you gotta try right? Go for a sanctify. Affix replaced. Crit Damage turned into All Stats. https://i.imgur.com/RcFi4LS.png I originally wrote this post in anger. Today I am just sad. Sad that a game I was really enjoying now feels utterly pointless to play. Sad that I was finally talking my gaming buddies into joining to compete on the leaderboard. And now I don't even want to play. This is the second time an incredible item has been ruined this way. The second character that now feels dead. I took a 3 day break the first time. Now I just feel like: why bother playing? Players and content creators begged endlessly to remove temper bricking. When it finally happened, the game felt great and engagement BOOMED. Little did we know they slipped something worse in the back door: Now you brick your items after investing tons of resources into getting them to sanctification phase. Now you can actually make your items and your character WEAKER. Bad or useless sanctifications are fine. That's RNG. But ruining your gear, making it worse/weaker/useless is just terrible. I would literally be better off if I hadn't played Diablo at all yesterday. I logged in, played a few hours, and ultimately went backwards. That's a brutal, backbreaking feeling that isn't why I play ARPGs or games at all really. The dev behind \"Affix Replaced\" should be moved to the Overwatch team. This sucks and hurts bad. :/ submitted by /u/muckbeast to r/diablo4 [link] [comments]",
      "link": "https://www.reddit.com/r/diablo4/comments/1qdnnyc/affix_replaced_just_bricked_my_character_no/",
      "author": "/u/muckbeast",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:20:09.560743"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdognw",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Multiple players in our ant colony RTS simulation 🐜🐜",
      "content": "Hey folks, I wanted to share a small milestone from an RTS-style ant colony simulation I’ve been working on. The game focuses on real-time colony management: digging tunnels, allocating workers, producing specialized castes, and reacting to a dynamic ecosystem (predators, resources, day–night cycle). Recently, I’ve added support for multiple players, allowing several colonies to exist and interact within the same world. If you’re curious, you can check out the Steam page here: https://store.steampowered.com/app/3016940/Garden_of_Ants/ Happy to hear any feedback or thoughts :) Best, Tomas submitted by /u/Able-Sherbert-4447 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdognw/multiple_players_in_our_ant_colony_rts_simulation/",
      "author": "/u/Able-Sherbert-4447",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.686665"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdo6ay",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "I build this game from 11 PM to 3 AM while my baby sleeps. Today I finally launched the Steam Page. Does the atmosphere feel 'dark' enough? I feel like working only at night has seeped into the game's art style",
      "content": "Hi everyone! I’m the solo dev from Chile behind this. To answer my own question: working in the absolute silence of 3 AM definitely changes how you draw. You start focusing on the shadows and the isolation a lot more, and I hope that translates into the game's atmosphere. About the game: Ashen Seed (formerly Seedbearer – I had to rebrand to avoid legal issues!) is a hand-drawn Metroidvania focused on ecological horror. Think Hollow Knight's exploration mixed with the tragic scale of Attack on Titan. Key features: No contact damage: Combat is about spacing and patterns. Hand-Drawn animation: Frame-by-frame traditional animation. A dark, non-linear world: Set in a subterranean civilization destroyed by surface Titans. If you like the vibe, a Wishlist helps the algorithm immensely (and motivates me to keep going tonight!): Steam Page: https://store.steampowered.com/app/4200980/Ashen_Seed/ Thanks for the support! submitted by /u/castelvania4 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdo6ay/i_build_this_game_from_11_pm_to_3_am_while_my/",
      "author": "/u/castelvania4",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.686702"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdo3xq",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "One of the many ways of slaying ankle-biting gobbos, a quintessential early enemy of any self-respecting RPG",
      "content": "Explosions are my personal favourite way to get rid of them, right next to shoving them into spikes and off high cliffs to splatter on the ground below. This clever usage of the environment and various props in it (and altitude difference between tiles) is a big component of how combat plays out in Happy Bastards, our up and coming tactical fantasy RPG set in an immoral world of monsters, heroes, bastards, and of course goblins (the kind that's corrupted by dark, malign forces). As far as combat goes, we wanted a tactical game where tactics are not just about outmaneuvering the enemy and positioning, but also setting traps for them and using what's at hand on the map to the best effect... like the kaboom shown here. Hope you enjoy this little footage I made in our ongoing playtest. submitted by /u/-Bastardous_Dastard- [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdo3xq/one_of_the_many_ways_of_slaying_anklebiting/",
      "author": "/u/-Bastardous_Dastard-",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.686727"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdo2c7",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Have been a huge investment considering my budget. But a new capsule was necessary.",
      "content": "submitted by /u/Garo3853 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdo2c7/have_been_a_huge_investment_considering_my_budget/",
      "author": "/u/Garo3853",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.686736"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdo0ff",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "May the mystery be with you 🐱",
      "content": "Sometimes references just happen. submitted by /u/Guvensrii [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdo0ff/may_the_mystery_be_with_you/",
      "author": "/u/Guvensrii",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.686746"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdnzpy",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "2 minutes of gameplay Tiny Delivery",
      "content": "submitted by /u/ArtemSinica [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdnzpy/2_minutes_of_gameplay_tiny_delivery/",
      "author": "/u/ArtemSinica",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.686752"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdo5vc",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "Now demo version of my game \"Formula 2.5\" is avaliable",
      "content": "submitted by /u/TandT-game [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdo5vc/now_demo_version_of_my_game_formula_25_is/",
      "author": "/u/TandT-game",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.686818"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdo4fd",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "Have been a huge investment considering my budget. But a new capsule was necessary.",
      "content": "submitted by /u/Garo3853 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdo4fd/have_been_a_huge_investment_considering_my_budget/",
      "author": "/u/Garo3853",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.686826"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdo47u",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "In an alternative reality, the Cold War ended in a nuclear conflict, and in these circumstances we meet a heroine who struggles with her demons. Dark",
      "content": "submitted by /u/sonsofwelder [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdo47u/in_an_alternative_reality_the_cold_war_ended_in_a/",
      "author": "/u/sonsofwelder",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.686834"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdomk2",
      "type": "post",
      "subreddit": "godot",
      "title": "i wanted to fix the glove normals in blender but whenever i import or even reimport it doesnt change",
      "content": "even though in blender its fixed submitted by /u/maxxm342 [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdomk2/i_wanted_to_fix_the_glove_normals_in_blender_but/",
      "author": "/u/maxxm342",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.686842"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdo5dm",
      "type": "post",
      "subreddit": "godot",
      "title": "what's causing this weird lighting with SDFGI?",
      "content": "sphere looks fine from the other side. here it's all patchy. submitted by /u/No_Lawfulness_106 [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdo5dm/whats_causing_this_weird_lighting_with_sdfgi/",
      "author": "/u/No_Lawfulness_106",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.686855"
    },
    {
      "id": "https://www.reddit.com/r/unity/t3_1qdnyiq",
      "type": "post",
      "subreddit": "unity",
      "title": "Help with baked animations in unity!",
      "content": "hello! i am working with a team on a project where we have over 200 animated meshes on screen that are being manipulated by an external slider. this project is for a museum and the computer they have is a bit older and slower, and we have experienced a lot of lag and were not sure if it is the amount of animated meshes or the computer's less than stellar amount of RAM, or both! the information i can give on the meshes is they are all planes with extremely low vertex counts and 4 bones at the max. we have looked into various different projects that involve baked animations (most of them relating to creating crowds) but it seems a lot of the tutorials are outdated, or assets they are using no longer exist. the only project that we found that we think can be viable is from the Megabonk creator's devlog, he isn't using a specific asset. (at least we don't think he is lol) https://youtu.be/gnxnmw5ryhg?si=G-tIcc0f5gBV6MGv&t=379 (link to video above) the only issue in the video is he only briefly touches on the subject, shows part of the code and moves on. any information about how we can achieve this in unity (unity 6 preferred!),other resources we should look into, search keywords, mentorship, etc would be greatly appreciated! thank you! submitted by /u/Hot-Archer1650 [link] [comments]",
      "link": "https://www.reddit.com/r/unity/comments/1qdnyiq/help_with_baked_animations_in_unity/",
      "author": "/u/Hot-Archer1650",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.686902"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdohfh",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "Batter turned into a dancer",
      "content": "submitted by /u/Boboter [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdohfh/batter_turned_into_a_dancer/",
      "author": "/u/Boboter",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.686943"
    },
    {
      "id": "https://www.reddit.com/t3_1qdozy0",
      "type": "search",
      "subreddit": "FORSAKENROBLOX",
      "title": "What is your favorite killer skins?",
      "content": "The reason i like them Ki ki ma ma:The Chase and the big ass sword made me love this skin for some reason c00lkid:The custom voicelines and kill animations are carrying this skin,it will definitly be better once the goddamn Chase theme comes out John doe:This skin js probably the most custom skin in the game,it has a completly diffrent model and a custom Kill animation for every Survivor, the other things are a cherry on top Noli:Though admin was a close second,i like the voicelines and Chase theme of this skin more so yeah this might be subjective(this whole thing is subjective but wharever) 1x4:i am a huge fan of TBB so i am a bit biased here though i still think its the best skin for 1x, the only thing it lacks is voicelines but they dont add that to much skins as well Guest 666(sixer):İ am also a huge undertale fan and this skins custom SFX really makes me love it(the M1 also perfectly ryhmes with my undertale hit sound) Nos:He doesnt have much skins but kill animation is cool i guess submitted by /u/Queasy-Voice-1800 to r/FORSAKENROBLOX [link] [comments]",
      "link": "https://www.reddit.com/r/FORSAKENROBLOX/comments/1qdozy0/what_is_your_favorite_killer_skins/",
      "author": "/u/Queasy-Voice-1800",
      "search_keyword": "make game without coding",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.688554"
    },
    {
      "id": "https://www.reddit.com/t3_1qdosts",
      "type": "search",
      "subreddit": "PlayASKA",
      "title": "Amazing game but I need the fix for iron parts hoarding bug!",
      "content": "The fact that no workers are dropping their used iron parts (axe heads, sword blades, etc) makes the game hard to play for me. We need the fix for this. Once my population is about 60 or so, it becomes such a chore to check all the relevant villager for their parts and gather them. I know the devs are working on this and more, and I am very thankful. This is an AMAZING game. But this bug is very annoying to me. submitted by /u/petrinaa to r/PlayASKA [link] [comments]",
      "link": "https://www.reddit.com/r/PlayASKA/comments/1qdosts/amazing_game_but_i_need_the_fix_for_iron_parts/",
      "author": "/u/petrinaa",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.689567"
    },
    {
      "id": "https://www.reddit.com/t3_1qdos48",
      "type": "search",
      "subreddit": "FortNiteBR",
      "title": "man i hate this bug",
      "content": "This bug has been around since the Simpsons Battle Pass and they haven't fixed it. I'm literally talking about a bug where you can't crouch or even slide. devs please fix it i'm literally trying to enjoy the game submitted by /u/Technical_Park1367 to r/FortNiteBR [link] [comments]",
      "link": "https://www.reddit.com/r/FortNiteBR/comments/1qdos48/man_i_hate_this_bug/",
      "author": "/u/Technical_Park1367",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T16:59:54.689576"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdpt67",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Making a Batman Arkham style game, with First person mode!",
      "content": "https://youtu.be/KgBNXcaZ-Yo?si=XwIX3XIT5A0bC0ps submitted by /u/ExplosivArt [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdpt67/making_a_batman_arkham_style_game_with_first/",
      "author": "/u/ExplosivArt",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T17:32:09.887730"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdptgf",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "I've finished some things in my game, what do you think?",
      "content": "submitted by /u/Gambacurta [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdptgf/ive_finished_some_things_in_my_game_what_do_you/",
      "author": "/u/Gambacurta",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T17:32:09.887746"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdpkyj",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "What do you do about story games?",
      "content": "TLDR; How can I organize and make story with different paths to choose from. So I want to make a text/story based game, but also make it a choices matter type of game, So you people who made a story based game with different branches and endings, How did you make the story? not the story itself but how did you organize different endings, different choices and so? Or, did you make a base story at first, then added couple of choices and added the ending depending on the choices you choose? submitted by /u/Jaessie_devs [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdpkyj/what_do_you_do_about_story_games/",
      "author": "/u/Jaessie_devs",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T17:32:09.887761"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdp2gu",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "Hired the most affordable artist I know (me) to take a shot at new capsule art. Here’s what I came up with",
      "content": "Now I'm looking at it, wondering: does it honestly show what this is? It's a narrative simulator and psychological horror about traveling in an RV to save people from their suicidal thoughts. Does this capture it for you? Steam: https://store.steampowered.com/app/4176620/ submitted by /u/Orizori_ [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdp2gu/hired_the_most_affordable_artist_i_know_me_to/",
      "author": "/u/Orizori_",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T17:32:09.887852"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdpr4i",
      "type": "post",
      "subreddit": "godot",
      "title": "I'm having a blast making menus (This counts as a menu right?)",
      "content": "Copyright? What's that? submitted by /u/Jolly-Ad-1161 [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdpr4i/im_having_a_blast_making_menus_this_counts_as_a/",
      "author": "/u/Jolly-Ad-1161",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T17:32:09.887859"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdpl6z",
      "type": "post",
      "subreddit": "godot",
      "title": "Help with rotation of sprite relative to mouse cursor?",
      "content": "Hi - I'm trying to make this spaceship follow the cursor and apply thrust in that direction, its applying thrust in the correct direction, that being towards the cursor, but the nose of the ship if always pointed 90 degree offset from the mouse. I tried manually changing rotation of the node by 90 degrees but it didnt change anything. heres my basic player script: \"extends Node2D # Movement settings u/export var max_speed: float = 1120.0 u/export var acceleration: float = 500.0 u/export var friction: float = 400.0 u/export \" var max_rot_speed: float = 0.75 # radians/sec var velocity: Vector2 = Vector2.ZERO func _physics_process(delta: float) -> void: rotate_towards_mouse(delta) apply_input(delta) move_ship(delta) update_thrusters() func rotate_towards_mouse(delta: float): var mouse_pos = get_global_mouse_position() var target_angle = (mouse_pos - global_position).angle() # Node2D rotation var angle_diff = wrapf(target_angle - rotation, -PI, PI) rotation += clamp(angle_diff, -max_rot_speed * delta, max_rot_speed * delta) func apply_input(delta: float): var thrust = Vector2.ZERO var forward = Vector2.UP.rotated(rotation) # forward = nose direction (sprite points up) if Input.is_action_pressed(\"forward\"): thrust = forward * acceleration elif Input.is_action_pressed(\"back\"): thrust = -forward * acceleration # Update velocity velocity += thrust * delta # Apply friction if no input if thrust == Vector2.ZERO: var friction_force = friction * delta if velocity.length() > friction_force: velocity = velocity.move_toward(Vector2.ZERO, friction_force) else: velocity = Vector2.ZERO # Clamp max speed if velocity.length() > max_speed: velocity = velocity.normalized() * max_speed func move_ship(delta: float): position += velocity * delta func update_thrusters(): var moving_forward = Input.is_action_pressed(\"forward\") $Ship1/thrusterJetL.visible = moving_forward $Ship1/thrusterJetR.visible = moving_forward submitted by /u/Confident_Effort_704 [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdpl6z/help_with_rotation_of_sprite_relative_to_mouse/",
      "author": "/u/Confident_Effort_704",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T17:32:09.887895"
    },
    {
      "id": "https://www.reddit.com/t3_1qdpp75",
      "type": "search",
      "subreddit": "RLSideSwipe",
      "title": "Let’s all say thanks to the developers",
      "content": "I can’t imagine it’s been easy to continue to be responsible and excited for a game that has been thrown to the wayside by much of the general RL community. And yet, the developers have shown up and taken care of the game and, especially this season, given opportunities for people to complete their collections and enjoy the game in whatever way they like. So thank you devs for all the hard work and everything you do to keep SideSwipe going and fun! submitted by /u/BigZestyy to r/RLSideSwipe [link] [comments]",
      "link": "https://www.reddit.com/r/RLSideSwipe/comments/1qdpp75/lets_all_say_thanks_to_the_developers/",
      "author": "/u/BigZestyy",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T17:32:09.889428"
    },
    {
      "id": "https://www.reddit.com/r/gamedev/t3_1qdqn8k",
      "type": "post",
      "subreddit": "gamedev",
      "title": "Building a calm, readable UI for a cozy world-builder in Godot - feedback wanted",
      "content": "Been working on Luminids for about 4 months so far - it's pre-alpha and early stages. I’m iterating on the version 1 UI for this calm, low-pressure world-builder and would really like feedback on clarity and flow. Built in Godot UI (custom theme) - especially interested in anything that feels unclear, distracting, or redundant right now. Short clip of the UI in motion (2 min): https://www.reddit.com/r/godot/comments/1qdqi2o/building_a_calm_readable_ui_for_a_cozy/ submitted by /u/Hostarro [link] [comments]",
      "link": "https://www.reddit.com/r/gamedev/comments/1qdqn8k/building_a_calm_readable_ui_for_a_cozy/",
      "author": "/u/Hostarro",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.362556"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdqyvj",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Do you think this intro is sufficient?",
      "content": "submitted by /u/BoneMarrowGames [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdqyvj/do_you_think_this_intro_is_sufficient/",
      "author": "/u/BoneMarrowGames",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.362569"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdqwz5",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Teaser is out!",
      "content": "Hello! After 3 semesters working on it with my college friends, we finally released our metroidvania's first teaser! submitted by /u/mariaelisaa [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdqwz5/teaser_is_out/",
      "author": "/u/mariaelisaa",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.362579"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdqb20",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Releasing caged skeletons to tank shots for you 💀",
      "content": "Many skeletons were harmed in the making of this. submitted by /u/InglenookGames [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdqb20/releasing_caged_skeletons_to_tank_shots_for_you/",
      "author": "/u/InglenookGames",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.362604"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdpxiu",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "I made a free, short (~5 mins), atmospheric horror experience in Godot. Feedback welcome.",
      "content": "This is my first complete project which I managed to finish by keeping it incredibly short. Link: therealdyer.itch.io/the-sleeping-problem submitted by /u/theRealDyer [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdpxiu/i_made_a_free_short_5_mins_atmospheric_horror/",
      "author": "/u/theRealDyer",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.362638"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdr5j6",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "A plague-born figure from a ritual scene we’re working on",
      "content": "This is one of the ritual figures from a co-op horror game we’re developing. It’s tied to a plague related ritual inspired by ancient mythology, sometimes it only watches, sometimes it moves closer, and sometimes its presence alone is enough to make players hesitate before acting. We focused less on shock value and more on making something that feels unnatural the longer you look at it. Does this feel creepy enough? If anyone’s curious, this is from \"Devil of the Plague\", Steam page for add to wishlist: https://store.steampowered.com/app/3429890/Devil_of_the_Plague/ submitted by /u/tridiART [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdr5j6/a_plagueborn_figure_from_a_ritual_scene_were/",
      "author": "/u/tridiART",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.362683"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdr3t9",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "which image do you think makes the best capsule image",
      "content": "Do you think any of them are good what improvement's would you like to see. submitted by /u/whynomakethings [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdr3t9/which_image_do_you_think_makes_the_best_capsule/",
      "author": "/u/whynomakethings",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.362691"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdqnbg",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "I made a free, short (~5 mins), low-poly, atmospheric horror experience in Godot. Feedback welcome.",
      "content": "This is my first complete project which I managed to finish by keeping it incredibly short. Link: therealdyer.itch.io/the-sleeping-problem submitted by /u/theRealDyer [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdqnbg/i_made_a_free_short_5_mins_lowpoly_atmospheric/",
      "author": "/u/theRealDyer",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.362712"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdqe7t",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "Added toxic looking mist at night so you know the night swarm is coming for your base, any thoughts on the mist?",
      "content": "submitted by /u/Wildboy_Studios [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdqe7t/added_toxic_looking_mist_at_night_so_you_know_the/",
      "author": "/u/Wildboy_Studios",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.362737"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdradb",
      "type": "post",
      "subreddit": "godot",
      "title": "Enemy Pathfinding with Navigation Agent",
      "content": "Hello everyone, I have a question for the Godot community. I am currently developing a side scrolling platforming action game. I am having a lot of trouble getting the NavigationAgent2D to work with this setup. I can make it work well for a top down game, but it seems not as intuitive in side scrolling with physics. Has anyone else run into this or made it work correctly in this setup? I have been using the NavigationAgent2D on enemies with a Navigation Mesh and Navigation links. However, with gravity and physics, they seem to behave a bit weird when it comes time to jump at a NavigationLink2D. submitted by /u/IDoTheDrawing [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdradb/enemy_pathfinding_with_navigation_agent/",
      "author": "/u/IDoTheDrawing",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.362802"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdqup1",
      "type": "post",
      "subreddit": "godot",
      "title": "Variable value changing without an apparent reason",
      "content": "https://preview.redd.it/hty6t6xtujdg1.png?width=301&format=png&auto=webp&s=b8acf59c7563fd3d4560d4160982aaa7ad549ff4 https://preview.redd.it/uaz2t7xtujdg1.png?width=513&format=png&auto=webp&s=7c93d0959bc91a932d9c448ca920dee13a4b5223 https://preview.redd.it/6yks28xtujdg1.png?width=212&format=png&auto=webp&s=9f9659d26d04e7e794db35f19ee14599bb60ab9b Yesterday I changed my code from export var wall_jump_force to the one in the screenshot. Before that, one of the values I set through the editor was -450, but I also set other values afterward. But whenever I try to access the variable wall_jump_force it still returns -450 even when I explicitly set it to a different value. There is no reference to it anywhere else in the project and the previous export line has already been removed. Changing its name seems to work but I don't know why. If I only change the variable name and not its references it returns Identifier \"wall_jump_force\" not declared in the current scope. However, if I change both the variable and references names there is no error, so I don't think there is something setting it to -450. I also tried reopening the project and restarting my computer, but that didn't work. submitted by /u/Grouchy_Gap8097 [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdqup1/variable_value_changing_without_an_apparent_reason/",
      "author": "/u/Grouchy_Gap8097",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.362829"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdqi2o",
      "type": "post",
      "subreddit": "godot",
      "title": "Building a calm, readable UI for a cozy world-builder in Godot (2-min dev clip)",
      "content": "Been working on Luminids for about 4 months so far - it's pre-alpha and early stages. I’m iterating on the version 1 UI for this calm, low-pressure world-builder and would really like feedback on clarity and flow. This short clip shows the current state of the interface in motion. Built in Godot UI (custom theme) - especially interested in anything that feels unclear, distracting, or redundant right now. submitted by /u/Hostarro [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdqi2o/building_a_calm_readable_ui_for_a_cozy/",
      "author": "/u/Hostarro",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.362862"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdqboa",
      "type": "post",
      "subreddit": "godot",
      "title": "After Post Processing",
      "content": "I decided to experiment with the world environment and light nodes in Godot. I used the glow feature while having a canvas modulate to darken the scene. submitted by /u/Dry-Economy6466 [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdqboa/after_post_processing/",
      "author": "/u/Dry-Economy6466",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.362893"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdq649",
      "type": "post",
      "subreddit": "godot",
      "title": "Just made a Godot Hub lol",
      "content": "submitted by /u/Putrid_Storage_7101 [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdq649/just_made_a_godot_hub_lol/",
      "author": "/u/Putrid_Storage_7101",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.362942"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdqqf9",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "Do you think this intro is sufficient?",
      "content": "submitted by /u/BoneMarrowGames [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdqqf9/do_you_think_this_intro_is_sufficient/",
      "author": "/u/BoneMarrowGames",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.363061"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdqoxq",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "Over the holiday, I made a free, short (~5 mins), atmospheric horror experience in Godot. Feedback welcome.",
      "content": "This is my first complete project which I managed to finish by keeping it incredibly short. Link: therealdyer.itch.io/the-sleeping-problem submitted by /u/theRealDyer [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdqoxq/over_the_holiday_i_made_a_free_short_5_mins/",
      "author": "/u/theRealDyer",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.363069"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdq6mf",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "Trying to balance the knockback in my game",
      "content": "Finding the sweet spot for how knockback works is a lot more complicated than I thought. submitted by /u/ArcaneFistGame [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdq6mf/trying_to_balance_the_knockback_in_my_game/",
      "author": "/u/ArcaneFistGame",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.363076"
    },
    {
      "id": "https://www.reddit.com/t3_1qdr8ez",
      "type": "search",
      "subreddit": "rivals",
      "title": "Marvel Rivals",
      "content": "What if the devs gave specific skins for characters who have altered counterparts like the hulk and red hulk for an example had passive abilities just as well a newly custom vfx and new team up ability I feel like it’ll make the game more contrast and more interesting to play submitted by /u/emp2crazyy to r/rivals [link] [comments]",
      "link": "https://www.reddit.com/r/rivals/comments/1qdr8ez/marvel_rivals/",
      "author": "/u/emp2crazyy",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.364952"
    },
    {
      "id": "https://www.reddit.com/t3_1qdrabm",
      "type": "search",
      "subreddit": "DungeonCrawlerCarl",
      "title": "DCC is Perfect for MTG",
      "content": "Heeeeey Guuuys! I just started playing MTG and I am at the very end of Book 6. I have burned through this series in a Month and a half, and I got into Magic The Gathering only two weeks ago. But now that I have two new obsessions and the gimmick of book 6 is fresh in my mind, I cannot help but think how perfect DCC would be for a crossover into MTG. With so many Characters, Mobs, Items, and effects that are in the dungeon. The possibilities are so vast, and especially with how many more floors of the dungeon there are left. If they jump on this at the end of the series they could make a massive set list. The Creature cards are obvious you have so many Characters, and fun creatures that Matt Dinniman has come up with. Instants, and Sorcery’s could be pulled from skills the crawlers and mobs have. Or just funny shit in the book like a “Time to Pay The Daddy Tax - Destroy Target Creature” I don’t know. I’m not a game designer, you get what I’m saying. It would just be really cool to see. I can’t be the only one with both of these obsessions and hope that one day their paths cross. Hell it doesn’t have to be MTG put these guys in Fortnite! Truly I just want as much DCC as I can get. Inject it into my veins. Anyway I know this post is a little nonsensical, and has possibly been discussed before but thank you for reading! submitted by /u/AscendedGalahad00 to r/DungeonCrawlerCarl [link] [comments]",
      "link": "https://www.reddit.com/r/DungeonCrawlerCarl/comments/1qdrabm/dcc_is_perfect_for_mtg/",
      "author": "/u/AscendedGalahad00",
      "search_keyword": "how to make a game",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:21:31.365079"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qds3h5",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "I just redesigned my Steam capsule title text. What do you think?",
      "content": "submitted by /u/dynamichuman03 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qds3h5/i_just_redesigned_my_steam_capsule_title_text/",
      "author": "/u/dynamichuman03",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:58:54.680323"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdrvx1",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "I just made a list of all Warsimlikes, currently 14 games inspired by my passion project and some of these are made by devs that are far better at game dev than me",
      "content": "submitted by /u/Huw2k8 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdrvx1/i_just_made_a_list_of_all_warsimlikes_currently/",
      "author": "/u/Huw2k8",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:58:54.680333"
    },
    {
      "id": "https://www.reddit.com/r/indiegaming/t3_1qdrtb3",
      "type": "post",
      "subreddit": "indiegaming",
      "title": "Come playtest my game The Razorform. It's fun! Feedback has been quite positive.. but always looking to hear from more people.",
      "content": "submitted by /u/PsyMorlon [link] [comments]",
      "link": "https://www.reddit.com/r/IndieGaming/comments/1qdrtb3/come_playtest_my_game_the_razorform_its_fun/",
      "author": "/u/PsyMorlon",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:58:54.680341"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qds9gh",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "I just redesigned my Steam capsule title text. What do you think?",
      "content": "submitted by /u/dynamichuman03 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qds9gh/i_just_redesigned_my_steam_capsule_title_text/",
      "author": "/u/dynamichuman03",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:58:54.680431"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qds1pd",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "My 3D-platformer wishlists after almost 2 months",
      "content": "submitted by /u/Illustrious_Move_838 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qds1pd/my_3dplatformer_wishlists_after_almost_2_months/",
      "author": "/u/Illustrious_Move_838",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:58:54.680460"
    },
    {
      "id": "https://www.reddit.com/r/IndieDev/t3_1qdrvpc",
      "type": "post",
      "subreddit": "IndieDev",
      "title": "I just made a list of all Warsimlikes, currently 14 games inspired by my passion project and some of these are made by devs that are far better at game dev than me",
      "content": "submitted by /u/Huw2k8 [link] [comments]",
      "link": "https://www.reddit.com/r/IndieDev/comments/1qdrvpc/i_just_made_a_list_of_all_warsimlikes_currently/",
      "author": "/u/Huw2k8",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:58:54.680502"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdrw1j",
      "type": "post",
      "subreddit": "godot",
      "title": "I made an interactive cassette player",
      "content": "i made an interactive cassette player to promote my new record which releases next week. https://loadcard.itch.io/thumbtack it works in both mobile and desktop browsers. godot doesn’t support audio rewinding so that was fun to solve. volume meters are driven by the actual volume of the AudioStreamSynchronized node's output. submitted by /u/unutella [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdrw1j/i_made_an_interactive_cassette_player/",
      "author": "/u/unutella",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:58:54.680578"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdrmop",
      "type": "post",
      "subreddit": "godot",
      "title": "Decided to improve my water shaders a little bit )",
      "content": "we are 2 brothers working on the game, it's called Tenkemo, and we just passed 100k wishlists on steam! :) submitted by /u/ccrroocc [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdrmop/decided_to_improve_my_water_shaders_a_little_bit/",
      "author": "/u/ccrroocc",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:58:54.680625"
    },
    {
      "id": "https://www.reddit.com/r/godot/t3_1qdrm4q",
      "type": "post",
      "subreddit": "godot",
      "title": "emit_signal()",
      "content": "For those who connect after. submitted by /u/Kipperfalcn [link] [comments]",
      "link": "https://www.reddit.com/r/godot/comments/1qdrm4q/emit_signal/",
      "author": "/u/Kipperfalcn",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:58:54.680631"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdruat",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "Defeated enemies go right into the recycling bin!",
      "content": "Working on my second steam game, a crazy mix of fake OS + dungeon crawler + match-3 as combat system called DungeonOS! Defeated enemies go right into the recycling bin, and you also have a clippy-like monster on the bottom right that gives you all kinds of tips :) https://store.steampowered.com/app/4221660/DungeonOS/ submitted by /u/BlackReape_r [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdruat/defeated_enemies_go_right_into_the_recycling_bin/",
      "author": "/u/BlackReape_r",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:58:54.680705"
    },
    {
      "id": "https://www.reddit.com/r/SoloDevelopment/t3_1qdrjhw",
      "type": "post",
      "subreddit": "SoloDevelopment",
      "title": "Hi guys - Screenshots of an arcade-style highscore-entry and the highscores-table for a new game I'm working on. What do you think?",
      "content": "submitted by /u/DidzDoesBytes [link] [comments]",
      "link": "https://www.reddit.com/r/SoloDevelopment/comments/1qdrjhw/hi_guys_screenshots_of_an_arcadestyle/",
      "author": "/u/DidzDoesBytes",
      "search_keyword": "",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:58:54.680713"
    },
    {
      "id": "https://www.reddit.com/t3_1qdsaau",
      "type": "search",
      "subreddit": "baseballcards",
      "title": "2019 Topps Update Hobby Box rip",
      "content": "submitted by /u/SithlordWolfGod to r/baseballcards [link] [comments]",
      "link": "https://www.reddit.com/r/baseballcards/comments/1qdsaau/2019_topps_update_hobby_box_rip/",
      "author": "/u/SithlordWolfGod",
      "search_keyword": "no code game",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:58:54.680720"
    },
    {
      "id": "https://www.reddit.com/t3_1qdsc9f",
      "type": "search",
      "subreddit": "Smite",
      "title": "Clash/Slash/Siege Mode for Smite 2",
      "content": "I know this has been brought up before but I really hope that they implement a game mode like one of these to Smite 2 soon, I’m finally enjoying it after playing over a decade of Smite 1. However Conquest is such a long game mode and such a commitment, whereas Arena feels like there isn’t enough objective or really structure past the basics. What I loved about Clash/Slash/Siege was that they all added a bit more to the game with the objectives etc. without the pressure and commitment of Conquest. Also Joust is only fun if you’re a 3 man pre-made and assault although fun is more like an arcade mode tbh. submitted by /u/OceansAbyss13 to r/Smite [link] [comments]",
      "link": "https://www.reddit.com/r/Smite/comments/1qdsc9f/clashslashsiege_mode_for_smite_2/",
      "author": "/u/OceansAbyss13",
      "search_keyword": "make game without coding",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:58:54.681196"
    },
    {
      "id": "https://www.reddit.com/t3_1qdsbmg",
      "type": "search",
      "subreddit": "paydaytheheist",
      "title": "Run + Gun = Fun",
      "content": "Hey guys, I missed the initial skills 2.0 release so I wanted to join in on the feedback on it. The removal of sprint reloading is insanely frustrating and entirely ruins the feel of the game for me. There's only so many times I can accidentally interrupt a reload without closing the game. The nerfs to ammo pickups combined with the cop buffs have also made the shooting feel so bad. I used to play this game just to have some run and gun fun... but now I'm punished for running and the gunning kinda sucks. I can see myself playing for a little bit longer to enjoy the new builds we got with skills 2.0. But I don't see myself hopping into the game just to have fun with my Car-4 / Scar like I did in the past. submitted by /u/Outplay-Prime to r/paydaytheheist [link] [comments]",
      "link": "https://www.reddit.com/r/paydaytheheist/comments/1qdsbmg/run_gun_fun/",
      "author": "/u/Outplay-Prime",
      "search_keyword": "make game without coding",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:58:54.681290"
    },
    {
      "id": "https://www.reddit.com/t3_1qdsbfz",
      "type": "search",
      "subreddit": "arboriculture",
      "title": "Norfolk Island pine care question",
      "content": "I did see the “trees do not belong in pots” rule of this sub, which I respect, however, my partner picked this tree up at a CVS years ago, and as we live in Zone 5B, it won’t survive outdoors…. Assuming mods decide to make an exception: This tree has been brought back from the brink of death being starved for light for several months. Now only a few branches still have the brown needles, which I believe was from the lack of light. it is currently in a south-facing window, and we are running a humidifier near it to counteract the woodstove. It seems much happier… Q: Should I prune out the last branches that still have brown needles or is it at a place where we should leave them be? A few branches are just tipped with brown, and a couple have brown needles closer to the trunk. (See pics) For the tips-only, could I just prune off JUST the brown tips without hurting it? Thanks! submitted by /u/TopBlueberry3 to r/arboriculture [link] [comments]",
      "link": "https://www.reddit.com/r/arboriculture/comments/1qdsbfz/norfolk_island_pine_care_question/",
      "author": "/u/TopBlueberry3",
      "search_keyword": "make game without coding",
      "relevance_score": 0,
      "added_at": "2026-01-15T18:58:54.681414"
    }
  ],
  "last_updated": "2026-01-15T19:00:33.690659"
}