{
  "queue": [
    {
      "id": "https://www.reddit.com/t3_1qdign1",
      "type": "search",
      "subreddit": "AvatarRealmsCollide",
      "title": "600k income/month for this game, yet they still dont have a shop to convert shards you dont need...",
      "content": "This game has about 600k income per month (android +ios), yet they still cant give players what they want. Mostly the the shop or event where you can trade shards you dont need anymore. Like when a character is maxed out 6 stars. For over 6 months they have been saying they are gonna do it ''soon'' on their discord. But still not here. All we get is extra bundles, passes and events to pay up. Really starting to be done with the greed of these devs. I love the game and i love Avatar, but they are just out for your money. PS: that Server vs Server thing is just to make the whales fight eachother with their bank accounts... submitted by /u/Asgard0822 to r/AvatarRealmsCollide [link] [comments]",
      "link": "https://www.reddit.com/r/AvatarRealmsCollide/comments/1qdign1/600k_incomemonth_for_this_game_yet_they_still/",
      "author": "/u/Asgard0822",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T12:53:47.160242"
    },
    {
      "id": "https://www.reddit.com/t3_1qdifh5",
      "type": "search",
      "subreddit": "DispatchAdHoc",
      "title": "Lazy writing or does Blazer just roll like that",
      "content": "Feeling genuinely confused right now, just finished the last episode and it’s so weird to me how blazer was just totally fine with finding out about Robert and Courtney. I mean you can see her clearly disappointed at the moment it’s revealed to her but after the fight and everything goes down she’s suddenly nonchalant and even encourages it?? Like it’s one thing to say “it’s fine” but what do you mean “make her happy”?? Is this the devs idea of catering to both characters fanbases cause for me it feels like they did blazer dirty and just bad writing. Honestly picked up the game after months of hearing about it and seeing it everywhere. I was told to choose invisigal by a friend and that blazer didn’t have the “depth” to her character but I can confidently say the hype for Invisigal just did not live up to my expectations and she seems very poorly written and unlikable in general.. (in my playthrough at least, only played through it once so lmk if other endings are better). submitted by /u/codekrauserr to r/DispatchAdHoc [link] [comments]",
      "link": "https://www.reddit.com/r/DispatchAdHoc/comments/1qdifh5/lazy_writing_or_does_blazer_just_roll_like_that/",
      "author": "/u/codekrauserr",
      "search_keyword": "game dev beginner",
      "relevance_score": 0,
      "added_at": "2026-01-15T12:53:47.160303"
    },
    {
      "id": "https://www.reddit.com/t3_1qdinx4",
      "type": "search",
      "subreddit": "LastDayonEarthGame",
      "title": "I found the answer to every question in LDOE",
      "content": "Why do I have so many duplicate dogs? Jerkdevs. Why do I get so many Winchester mods? Jerkdevs. Why do I have the same tactical gear parts coming out of my nose? Jerkdevs. Why does the game adjust to withhold what I need to finish quests? Jerkdevs. Why are vehicle parts so hard to find? Jerkdevs. Why do I get those vehicle parts en masse after I finish the vehicle? Jerkdevs. Why do random roaming NPCs not actually roam randomly, and slow chase me away from everything (boxes, resources, bodies, etc.)? Jerkdevs. Why does NPC survivor after NPC survivor show up in resource zones to disrupt zone farming? Jerkdevs. Why does the Wendigo and TBO show up several times in a row to stop my resource farming? Jerkdevs. Why couldn’t I get the heavily-promoted cat without abandoning my clan for one with more points? Jerkdevs. How can we (the jerkdevs) make the game more terrible for our players? Jerkdevs. I could go on, but my flipping gas canister is leaking, and I have to go back in game to fill up the chemistry station. Jerkdevs. submitted by /u/Separate-Cable-8800 to r/LastDayonEarthGame [link] [comments]",
      "link": "https://www.reddit.com/r/LastDayonEarthGame/comments/1qdinx4/i_found_the_answer_to_every_question_in_ldoe/",
      "author": "/u/Separate-Cable-8800",
      "search_keyword": "how to make a game",
      "relevance_score": 0,
      "added_at": "2026-01-15T12:53:47.160349"
    }
  ],
  "last_updated": "2026-01-15T12:55:28.568598"
}